// Generated by jextract

package org.vybe.jolt;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct JPC_ContactManifold {
 *     JPC_Real base_offset[4];
 *     float normal[4];
 *     float penetration_depth;
 *     JPC_SubShapeID shape1_sub_shape_id;
 *     JPC_SubShapeID shape2_sub_shape_id;
 *     struct {
 *         uint32_t num_points;
 *         float points[64][4];
 *     } shape1_relative_contact;
 *     struct {
 *         uint32_t num_points;
 *         float points[64][4];
 *     } shape2_relative_contact;
 * }
 * }
 */
public class JPC_ContactManifold {

    JPC_ContactManifold() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MemoryLayout.sequenceLayout(4, jolt.C_FLOAT).withName("base_offset"),
        MemoryLayout.sequenceLayout(4, jolt.C_FLOAT).withName("normal"),
        jolt.C_FLOAT.withName("penetration_depth"),
        jolt.C_INT.withName("shape1_sub_shape_id"),
        jolt.C_INT.withName("shape2_sub_shape_id"),
        MemoryLayout.paddingLayout(4),
        JPC_ContactManifold.shape1_relative_contact.layout().withName("shape1_relative_contact"),
        JPC_ContactManifold.shape2_relative_contact.layout().withName("shape2_relative_contact")
    ).withName("JPC_ContactManifold");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final SequenceLayout base_offset$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("base_offset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * JPC_Real base_offset[4]
     * }
     */
    public static final SequenceLayout base_offset$layout() {
        return base_offset$LAYOUT;
    }

    private static final long base_offset$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * JPC_Real base_offset[4]
     * }
     */
    public static final long base_offset$offset() {
        return base_offset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * JPC_Real base_offset[4]
     * }
     */
    public static MemorySegment base_offset(MemorySegment struct) {
        return struct.asSlice(base_offset$OFFSET, base_offset$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * JPC_Real base_offset[4]
     * }
     */
    public static void base_offset(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, base_offset$OFFSET, base_offset$LAYOUT.byteSize());
    }

    private static long[] base_offset$DIMS = { 4 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * JPC_Real base_offset[4]
     * }
     */
    public static long[] base_offset$dimensions() {
        return base_offset$DIMS;
    }
    private static final VarHandle base_offset$ELEM_HANDLE = base_offset$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * JPC_Real base_offset[4]
     * }
     */
    public static float base_offset(MemorySegment struct, long index0) {
        return (float)base_offset$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * JPC_Real base_offset[4]
     * }
     */
    public static void base_offset(MemorySegment struct, long index0, float fieldValue) {
        base_offset$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final SequenceLayout normal$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("normal"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float normal[4]
     * }
     */
    public static final SequenceLayout normal$layout() {
        return normal$LAYOUT;
    }

    private static final long normal$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float normal[4]
     * }
     */
    public static final long normal$offset() {
        return normal$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float normal[4]
     * }
     */
    public static MemorySegment normal(MemorySegment struct) {
        return struct.asSlice(normal$OFFSET, normal$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float normal[4]
     * }
     */
    public static void normal(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, normal$OFFSET, normal$LAYOUT.byteSize());
    }

    private static long[] normal$DIMS = { 4 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * float normal[4]
     * }
     */
    public static long[] normal$dimensions() {
        return normal$DIMS;
    }
    private static final VarHandle normal$ELEM_HANDLE = normal$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * float normal[4]
     * }
     */
    public static float normal(MemorySegment struct, long index0) {
        return (float)normal$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * float normal[4]
     * }
     */
    public static void normal(MemorySegment struct, long index0, float fieldValue) {
        normal$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    private static final OfFloat penetration_depth$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("penetration_depth"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float penetration_depth
     * }
     */
    public static final OfFloat penetration_depth$layout() {
        return penetration_depth$LAYOUT;
    }

    private static final long penetration_depth$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float penetration_depth
     * }
     */
    public static final long penetration_depth$offset() {
        return penetration_depth$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float penetration_depth
     * }
     */
    public static float penetration_depth(MemorySegment struct) {
        return struct.get(penetration_depth$LAYOUT, penetration_depth$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float penetration_depth
     * }
     */
    public static void penetration_depth(MemorySegment struct, float fieldValue) {
        struct.set(penetration_depth$LAYOUT, penetration_depth$OFFSET, fieldValue);
    }

    private static final OfInt shape1_sub_shape_id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shape1_sub_shape_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * JPC_SubShapeID shape1_sub_shape_id
     * }
     */
    public static final OfInt shape1_sub_shape_id$layout() {
        return shape1_sub_shape_id$LAYOUT;
    }

    private static final long shape1_sub_shape_id$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * JPC_SubShapeID shape1_sub_shape_id
     * }
     */
    public static final long shape1_sub_shape_id$offset() {
        return shape1_sub_shape_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * JPC_SubShapeID shape1_sub_shape_id
     * }
     */
    public static int shape1_sub_shape_id(MemorySegment struct) {
        return struct.get(shape1_sub_shape_id$LAYOUT, shape1_sub_shape_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * JPC_SubShapeID shape1_sub_shape_id
     * }
     */
    public static void shape1_sub_shape_id(MemorySegment struct, int fieldValue) {
        struct.set(shape1_sub_shape_id$LAYOUT, shape1_sub_shape_id$OFFSET, fieldValue);
    }

    private static final OfInt shape2_sub_shape_id$LAYOUT = (OfInt)$LAYOUT.select(groupElement("shape2_sub_shape_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * JPC_SubShapeID shape2_sub_shape_id
     * }
     */
    public static final OfInt shape2_sub_shape_id$layout() {
        return shape2_sub_shape_id$LAYOUT;
    }

    private static final long shape2_sub_shape_id$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * JPC_SubShapeID shape2_sub_shape_id
     * }
     */
    public static final long shape2_sub_shape_id$offset() {
        return shape2_sub_shape_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * JPC_SubShapeID shape2_sub_shape_id
     * }
     */
    public static int shape2_sub_shape_id(MemorySegment struct) {
        return struct.get(shape2_sub_shape_id$LAYOUT, shape2_sub_shape_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * JPC_SubShapeID shape2_sub_shape_id
     * }
     */
    public static void shape2_sub_shape_id(MemorySegment struct, int fieldValue) {
        struct.set(shape2_sub_shape_id$LAYOUT, shape2_sub_shape_id$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * struct {
     *     uint32_t num_points;
     *     float points[64][4];
     * }
     * }
     */
    public static class shape1_relative_contact {

        shape1_relative_contact() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
            jolt.C_INT.withName("num_points"),
            MemoryLayout.paddingLayout(12),
            MemoryLayout.sequenceLayout(64, MemoryLayout.sequenceLayout(4, jolt.C_FLOAT)).withName("points")
        ).withName("$anon$534:5");

        /**
         * The layout of this struct
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final OfInt num_points$LAYOUT = (OfInt)$LAYOUT.select(groupElement("num_points"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * uint32_t num_points
         * }
         */
        public static final OfInt num_points$layout() {
            return num_points$LAYOUT;
        }

        private static final long num_points$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * uint32_t num_points
         * }
         */
        public static final long num_points$offset() {
            return num_points$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * uint32_t num_points
         * }
         */
        public static int num_points(MemorySegment struct) {
            return struct.get(num_points$LAYOUT, num_points$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * uint32_t num_points
         * }
         */
        public static void num_points(MemorySegment struct, int fieldValue) {
            struct.set(num_points$LAYOUT, num_points$OFFSET, fieldValue);
        }

        private static final SequenceLayout points$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("points"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * float points[64][4]
         * }
         */
        public static final SequenceLayout points$layout() {
            return points$LAYOUT;
        }

        private static final long points$OFFSET = 16;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * float points[64][4]
         * }
         */
        public static final long points$offset() {
            return points$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * float points[64][4]
         * }
         */
        public static MemorySegment points(MemorySegment struct) {
            return struct.asSlice(points$OFFSET, points$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * float points[64][4]
         * }
         */
        public static void points(MemorySegment struct, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, struct, points$OFFSET, points$LAYOUT.byteSize());
        }

        private static long[] points$DIMS = { 64, 4 };

        /**
         * Dimensions for array field:
         * {@snippet lang=c :
         * float points[64][4]
         * }
         */
        public static long[] points$dimensions() {
            return points$DIMS;
        }
        private static final VarHandle points$ELEM_HANDLE = points$LAYOUT.varHandle(sequenceElement(), sequenceElement());

        /**
         * Indexed getter for field:
         * {@snippet lang=c :
         * float points[64][4]
         * }
         */
        public static float points(MemorySegment struct, long index0, long index1) {
            return (float)points$ELEM_HANDLE.get(struct, 0L, index0, index1);
        }

        /**
         * Indexed setter for field:
         * {@snippet lang=c :
         * float points[64][4]
         * }
         */
        public static void points(MemorySegment struct, long index0, long index1, float fieldValue) {
            points$ELEM_HANDLE.set(struct, 0L, index0, index1, fieldValue);
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this struct
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout shape1_relative_contact$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("shape1_relative_contact"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t num_points;
     *     float points[64][4];
     * } shape1_relative_contact
     * }
     */
    public static final GroupLayout shape1_relative_contact$layout() {
        return shape1_relative_contact$LAYOUT;
    }

    private static final long shape1_relative_contact$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t num_points;
     *     float points[64][4];
     * } shape1_relative_contact
     * }
     */
    public static final long shape1_relative_contact$offset() {
        return shape1_relative_contact$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t num_points;
     *     float points[64][4];
     * } shape1_relative_contact
     * }
     */
    public static MemorySegment shape1_relative_contact(MemorySegment struct) {
        return struct.asSlice(shape1_relative_contact$OFFSET, shape1_relative_contact$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t num_points;
     *     float points[64][4];
     * } shape1_relative_contact
     * }
     */
    public static void shape1_relative_contact(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, shape1_relative_contact$OFFSET, shape1_relative_contact$LAYOUT.byteSize());
    }

    /**
     * {@snippet lang=c :
     * struct {
     *     uint32_t num_points;
     *     float points[64][4];
     * }
     * }
     */
    public static class shape2_relative_contact {

        shape2_relative_contact() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
            jolt.C_INT.withName("num_points"),
            MemoryLayout.paddingLayout(12),
            MemoryLayout.sequenceLayout(64, MemoryLayout.sequenceLayout(4, jolt.C_FLOAT)).withName("points")
        ).withName("$anon$538:5");

        /**
         * The layout of this struct
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final OfInt num_points$LAYOUT = (OfInt)$LAYOUT.select(groupElement("num_points"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * uint32_t num_points
         * }
         */
        public static final OfInt num_points$layout() {
            return num_points$LAYOUT;
        }

        private static final long num_points$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * uint32_t num_points
         * }
         */
        public static final long num_points$offset() {
            return num_points$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * uint32_t num_points
         * }
         */
        public static int num_points(MemorySegment struct) {
            return struct.get(num_points$LAYOUT, num_points$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * uint32_t num_points
         * }
         */
        public static void num_points(MemorySegment struct, int fieldValue) {
            struct.set(num_points$LAYOUT, num_points$OFFSET, fieldValue);
        }

        private static final SequenceLayout points$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("points"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * float points[64][4]
         * }
         */
        public static final SequenceLayout points$layout() {
            return points$LAYOUT;
        }

        private static final long points$OFFSET = 16;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * float points[64][4]
         * }
         */
        public static final long points$offset() {
            return points$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * float points[64][4]
         * }
         */
        public static MemorySegment points(MemorySegment struct) {
            return struct.asSlice(points$OFFSET, points$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * float points[64][4]
         * }
         */
        public static void points(MemorySegment struct, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, struct, points$OFFSET, points$LAYOUT.byteSize());
        }

        private static long[] points$DIMS = { 64, 4 };

        /**
         * Dimensions for array field:
         * {@snippet lang=c :
         * float points[64][4]
         * }
         */
        public static long[] points$dimensions() {
            return points$DIMS;
        }
        private static final VarHandle points$ELEM_HANDLE = points$LAYOUT.varHandle(sequenceElement(), sequenceElement());

        /**
         * Indexed getter for field:
         * {@snippet lang=c :
         * float points[64][4]
         * }
         */
        public static float points(MemorySegment struct, long index0, long index1) {
            return (float)points$ELEM_HANDLE.get(struct, 0L, index0, index1);
        }

        /**
         * Indexed setter for field:
         * {@snippet lang=c :
         * float points[64][4]
         * }
         */
        public static void points(MemorySegment struct, long index0, long index1, float fieldValue) {
            points$ELEM_HANDLE.set(struct, 0L, index0, index1, fieldValue);
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this struct
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout shape2_relative_contact$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("shape2_relative_contact"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t num_points;
     *     float points[64][4];
     * } shape2_relative_contact
     * }
     */
    public static final GroupLayout shape2_relative_contact$layout() {
        return shape2_relative_contact$LAYOUT;
    }

    private static final long shape2_relative_contact$OFFSET = 1088;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t num_points;
     *     float points[64][4];
     * } shape2_relative_contact
     * }
     */
    public static final long shape2_relative_contact$offset() {
        return shape2_relative_contact$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t num_points;
     *     float points[64][4];
     * } shape2_relative_contact
     * }
     */
    public static MemorySegment shape2_relative_contact(MemorySegment struct) {
        return struct.asSlice(shape2_relative_contact$OFFSET, shape2_relative_contact$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct {
     *     uint32_t num_points;
     *     float points[64][4];
     * } shape2_relative_contact
     * }
     */
    public static void shape2_relative_contact(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, shape2_relative_contact$OFFSET, shape2_relative_contact$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

