// Generated by jextract

package org.vybe.flecs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int32_t count;
 *     ecs_size_t bytes_component_record;
 *     ecs_size_t bytes_table_cache;
 *     ecs_size_t bytes_name_index;
 *     ecs_size_t bytes_ordered_children;
 *     ecs_size_t bytes_reachable_cache;
 * }
 * }
 */
public class ecs_component_index_memory_t {

    ecs_component_index_memory_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        flecs.C_INT.withName("count"),
        flecs.C_INT.withName("bytes_component_record"),
        flecs.C_INT.withName("bytes_table_cache"),
        flecs.C_INT.withName("bytes_name_index"),
        flecs.C_INT.withName("bytes_ordered_children"),
        flecs.C_INT.withName("bytes_reachable_cache")
    ).withName("$anon$13621:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t count
     * }
     */
    public static final OfInt count$layout() {
        return count$LAYOUT;
    }

    private static final long count$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t count
     * }
     */
    public static final long count$offset() {
        return count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t count
     * }
     */
    public static int count(MemorySegment struct) {
        return struct.get(count$LAYOUT, count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t count
     * }
     */
    public static void count(MemorySegment struct, int fieldValue) {
        struct.set(count$LAYOUT, count$OFFSET, fieldValue);
    }

    private static final OfInt bytes_component_record$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_component_record"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_record
     * }
     */
    public static final OfInt bytes_component_record$layout() {
        return bytes_component_record$LAYOUT;
    }

    private static final long bytes_component_record$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_record
     * }
     */
    public static final long bytes_component_record$offset() {
        return bytes_component_record$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_record
     * }
     */
    public static int bytes_component_record(MemorySegment struct) {
        return struct.get(bytes_component_record$LAYOUT, bytes_component_record$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_record
     * }
     */
    public static void bytes_component_record(MemorySegment struct, int fieldValue) {
        struct.set(bytes_component_record$LAYOUT, bytes_component_record$OFFSET, fieldValue);
    }

    private static final OfInt bytes_table_cache$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_table_cache"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_cache
     * }
     */
    public static final OfInt bytes_table_cache$layout() {
        return bytes_table_cache$LAYOUT;
    }

    private static final long bytes_table_cache$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_cache
     * }
     */
    public static final long bytes_table_cache$offset() {
        return bytes_table_cache$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_cache
     * }
     */
    public static int bytes_table_cache(MemorySegment struct) {
        return struct.get(bytes_table_cache$LAYOUT, bytes_table_cache$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_cache
     * }
     */
    public static void bytes_table_cache(MemorySegment struct, int fieldValue) {
        struct.set(bytes_table_cache$LAYOUT, bytes_table_cache$OFFSET, fieldValue);
    }

    private static final OfInt bytes_name_index$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_name_index"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_name_index
     * }
     */
    public static final OfInt bytes_name_index$layout() {
        return bytes_name_index$LAYOUT;
    }

    private static final long bytes_name_index$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_name_index
     * }
     */
    public static final long bytes_name_index$offset() {
        return bytes_name_index$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_name_index
     * }
     */
    public static int bytes_name_index(MemorySegment struct) {
        return struct.get(bytes_name_index$LAYOUT, bytes_name_index$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_name_index
     * }
     */
    public static void bytes_name_index(MemorySegment struct, int fieldValue) {
        struct.set(bytes_name_index$LAYOUT, bytes_name_index$OFFSET, fieldValue);
    }

    private static final OfInt bytes_ordered_children$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_ordered_children"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_ordered_children
     * }
     */
    public static final OfInt bytes_ordered_children$layout() {
        return bytes_ordered_children$LAYOUT;
    }

    private static final long bytes_ordered_children$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_ordered_children
     * }
     */
    public static final long bytes_ordered_children$offset() {
        return bytes_ordered_children$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_ordered_children
     * }
     */
    public static int bytes_ordered_children(MemorySegment struct) {
        return struct.get(bytes_ordered_children$LAYOUT, bytes_ordered_children$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_ordered_children
     * }
     */
    public static void bytes_ordered_children(MemorySegment struct, int fieldValue) {
        struct.set(bytes_ordered_children$LAYOUT, bytes_ordered_children$OFFSET, fieldValue);
    }

    private static final OfInt bytes_reachable_cache$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_reachable_cache"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_reachable_cache
     * }
     */
    public static final OfInt bytes_reachable_cache$layout() {
        return bytes_reachable_cache$LAYOUT;
    }

    private static final long bytes_reachable_cache$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_reachable_cache
     * }
     */
    public static final long bytes_reachable_cache$offset() {
        return bytes_reachable_cache$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_reachable_cache
     * }
     */
    public static int bytes_reachable_cache(MemorySegment struct) {
        return struct.get(bytes_reachable_cache$LAYOUT, bytes_reachable_cache$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_reachable_cache
     * }
     */
    public static void bytes_reachable_cache(MemorySegment struct, int fieldValue) {
        struct.set(bytes_reachable_cache$LAYOUT, bytes_reachable_cache$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

