// Generated by jextract

package org.vybe.flecs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ecs_meta_op_t {
 *     ecs_meta_op_kind_t kind;
 *     ecs_meta_op_kind_t underlying_kind;
 *     ecs_size_t offset;
 *     const char *name;
 *     ecs_size_t elem_size;
 *     int16_t op_count;
 *     int16_t member_index;
 *     ecs_entity_t type;
 *     const ecs_type_info_t *type_info;
 *     union {
 *         ecs_hashmap_t *members;
 *         ecs_map_t *constants;
 *         ecs_meta_serialize_t opaque;
 *     } is;
 * }
 * }
 */
public class ecs_meta_op_t {

    ecs_meta_op_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        flecs.C_INT.withName("kind"),
        flecs.C_INT.withName("underlying_kind"),
        flecs.C_INT.withName("offset"),
        MemoryLayout.paddingLayout(4),
        flecs.C_POINTER.withName("name"),
        flecs.C_INT.withName("elem_size"),
        flecs.C_SHORT.withName("op_count"),
        flecs.C_SHORT.withName("member_index"),
        flecs.C_LONG_LONG.withName("type"),
        flecs.C_POINTER.withName("type_info"),
        ecs_meta_op_t.is.layout().withName("is")
    ).withName("ecs_meta_op_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt kind$LAYOUT = (OfInt)$LAYOUT.select(groupElement("kind"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_meta_op_kind_t kind
     * }
     */
    public static final OfInt kind$layout() {
        return kind$LAYOUT;
    }

    private static final long kind$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_meta_op_kind_t kind
     * }
     */
    public static final long kind$offset() {
        return kind$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_meta_op_kind_t kind
     * }
     */
    public static int kind(MemorySegment struct) {
        return struct.get(kind$LAYOUT, kind$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_meta_op_kind_t kind
     * }
     */
    public static void kind(MemorySegment struct, int fieldValue) {
        struct.set(kind$LAYOUT, kind$OFFSET, fieldValue);
    }

    private static final OfInt underlying_kind$LAYOUT = (OfInt)$LAYOUT.select(groupElement("underlying_kind"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_meta_op_kind_t underlying_kind
     * }
     */
    public static final OfInt underlying_kind$layout() {
        return underlying_kind$LAYOUT;
    }

    private static final long underlying_kind$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_meta_op_kind_t underlying_kind
     * }
     */
    public static final long underlying_kind$offset() {
        return underlying_kind$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_meta_op_kind_t underlying_kind
     * }
     */
    public static int underlying_kind(MemorySegment struct) {
        return struct.get(underlying_kind$LAYOUT, underlying_kind$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_meta_op_kind_t underlying_kind
     * }
     */
    public static void underlying_kind(MemorySegment struct, int fieldValue) {
        struct.set(underlying_kind$LAYOUT, underlying_kind$OFFSET, fieldValue);
    }

    private static final OfInt offset$LAYOUT = (OfInt)$LAYOUT.select(groupElement("offset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t offset
     * }
     */
    public static final OfInt offset$layout() {
        return offset$LAYOUT;
    }

    private static final long offset$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t offset
     * }
     */
    public static final long offset$offset() {
        return offset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t offset
     * }
     */
    public static int offset(MemorySegment struct) {
        return struct.get(offset$LAYOUT, offset$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t offset
     * }
     */
    public static void offset(MemorySegment struct, int fieldValue) {
        struct.set(offset$LAYOUT, offset$OFFSET, fieldValue);
    }

    private static final AddressLayout name$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final AddressLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.get(name$LAYOUT, name$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *name
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(name$LAYOUT, name$OFFSET, fieldValue);
    }

    private static final OfInt elem_size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("elem_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t elem_size
     * }
     */
    public static final OfInt elem_size$layout() {
        return elem_size$LAYOUT;
    }

    private static final long elem_size$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t elem_size
     * }
     */
    public static final long elem_size$offset() {
        return elem_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t elem_size
     * }
     */
    public static int elem_size(MemorySegment struct) {
        return struct.get(elem_size$LAYOUT, elem_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t elem_size
     * }
     */
    public static void elem_size(MemorySegment struct, int fieldValue) {
        struct.set(elem_size$LAYOUT, elem_size$OFFSET, fieldValue);
    }

    private static final OfShort op_count$LAYOUT = (OfShort)$LAYOUT.select(groupElement("op_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int16_t op_count
     * }
     */
    public static final OfShort op_count$layout() {
        return op_count$LAYOUT;
    }

    private static final long op_count$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int16_t op_count
     * }
     */
    public static final long op_count$offset() {
        return op_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int16_t op_count
     * }
     */
    public static short op_count(MemorySegment struct) {
        return struct.get(op_count$LAYOUT, op_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int16_t op_count
     * }
     */
    public static void op_count(MemorySegment struct, short fieldValue) {
        struct.set(op_count$LAYOUT, op_count$OFFSET, fieldValue);
    }

    private static final OfShort member_index$LAYOUT = (OfShort)$LAYOUT.select(groupElement("member_index"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int16_t member_index
     * }
     */
    public static final OfShort member_index$layout() {
        return member_index$LAYOUT;
    }

    private static final long member_index$OFFSET = 30;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int16_t member_index
     * }
     */
    public static final long member_index$offset() {
        return member_index$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int16_t member_index
     * }
     */
    public static short member_index(MemorySegment struct) {
        return struct.get(member_index$LAYOUT, member_index$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int16_t member_index
     * }
     */
    public static void member_index(MemorySegment struct, short fieldValue) {
        struct.set(member_index$LAYOUT, member_index$OFFSET, fieldValue);
    }

    private static final OfLong type$LAYOUT = (OfLong)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_entity_t type
     * }
     */
    public static final OfLong type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_entity_t type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_entity_t type
     * }
     */
    public static long type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_entity_t type
     * }
     */
    public static void type(MemorySegment struct, long fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final AddressLayout type_info$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("type_info"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const ecs_type_info_t *type_info
     * }
     */
    public static final AddressLayout type_info$layout() {
        return type_info$LAYOUT;
    }

    private static final long type_info$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const ecs_type_info_t *type_info
     * }
     */
    public static final long type_info$offset() {
        return type_info$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const ecs_type_info_t *type_info
     * }
     */
    public static MemorySegment type_info(MemorySegment struct) {
        return struct.get(type_info$LAYOUT, type_info$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const ecs_type_info_t *type_info
     * }
     */
    public static void type_info(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(type_info$LAYOUT, type_info$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * union {
     *     ecs_hashmap_t *members;
     *     ecs_map_t *constants;
     *     ecs_meta_serialize_t opaque;
     * }
     * }
     */
    public static class is {

        is() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
            flecs.C_POINTER.withName("members"),
            flecs.C_POINTER.withName("constants"),
            flecs.C_POINTER.withName("opaque")
        ).withName("$anon$16946:5");

        /**
         * The layout of this union
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final AddressLayout members$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("members"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * ecs_hashmap_t *members
         * }
         */
        public static final AddressLayout members$layout() {
            return members$LAYOUT;
        }

        private static final long members$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * ecs_hashmap_t *members
         * }
         */
        public static final long members$offset() {
            return members$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * ecs_hashmap_t *members
         * }
         */
        public static MemorySegment members(MemorySegment union) {
            return union.get(members$LAYOUT, members$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * ecs_hashmap_t *members
         * }
         */
        public static void members(MemorySegment union, MemorySegment fieldValue) {
            union.set(members$LAYOUT, members$OFFSET, fieldValue);
        }

        private static final AddressLayout constants$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("constants"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * ecs_map_t *constants
         * }
         */
        public static final AddressLayout constants$layout() {
            return constants$LAYOUT;
        }

        private static final long constants$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * ecs_map_t *constants
         * }
         */
        public static final long constants$offset() {
            return constants$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * ecs_map_t *constants
         * }
         */
        public static MemorySegment constants(MemorySegment union) {
            return union.get(constants$LAYOUT, constants$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * ecs_map_t *constants
         * }
         */
        public static void constants(MemorySegment union, MemorySegment fieldValue) {
            union.set(constants$LAYOUT, constants$OFFSET, fieldValue);
        }

        private static final AddressLayout opaque$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("opaque"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * ecs_meta_serialize_t opaque
         * }
         */
        public static final AddressLayout opaque$layout() {
            return opaque$LAYOUT;
        }

        private static final long opaque$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * ecs_meta_serialize_t opaque
         * }
         */
        public static final long opaque$offset() {
            return opaque$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * ecs_meta_serialize_t opaque
         * }
         */
        public static MemorySegment opaque(MemorySegment union) {
            return union.get(opaque$LAYOUT, opaque$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * ecs_meta_serialize_t opaque
         * }
         */
        public static void opaque(MemorySegment union, MemorySegment fieldValue) {
            union.set(opaque$LAYOUT, opaque$OFFSET, fieldValue);
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this union
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout is$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("is"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union {
     *     ecs_hashmap_t *members;
     *     ecs_map_t *constants;
     *     ecs_meta_serialize_t opaque;
     * } is
     * }
     */
    public static final GroupLayout is$layout() {
        return is$LAYOUT;
    }

    private static final long is$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union {
     *     ecs_hashmap_t *members;
     *     ecs_map_t *constants;
     *     ecs_meta_serialize_t opaque;
     * } is
     * }
     */
    public static final long is$offset() {
        return is$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union {
     *     ecs_hashmap_t *members;
     *     ecs_map_t *constants;
     *     ecs_meta_serialize_t opaque;
     * } is
     * }
     */
    public static MemorySegment is(MemorySegment struct) {
        return struct.asSlice(is$OFFSET, is$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union {
     *     ecs_hashmap_t *members;
     *     ecs_map_t *constants;
     *     ecs_meta_serialize_t opaque;
     * } is
     * }
     */
    public static void is(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, is$OFFSET, is$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

