// Generated by jextract

package org.vybe.flecs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ecs_meta_scope_t {
 *     ecs_entity_t type;
 *     ecs_meta_op_t *ops;
 *     int16_t ops_count;
 *     int16_t ops_cur;
 *     int16_t prev_depth;
 *     void *ptr;
 *     const EcsOpaque *opaque;
 *     ecs_hashmap_t *members;
 *     bool is_collection;
 *     bool is_empty_scope;
 *     bool is_moved_scope;
 *     int32_t elem;
 *     int32_t elem_count;
 * }
 * }
 */
public class ecs_meta_scope_t {

    ecs_meta_scope_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        flecs.C_LONG_LONG.withName("type"),
        flecs.C_POINTER.withName("ops"),
        flecs.C_SHORT.withName("ops_count"),
        flecs.C_SHORT.withName("ops_cur"),
        flecs.C_SHORT.withName("prev_depth"),
        MemoryLayout.paddingLayout(2),
        flecs.C_POINTER.withName("ptr"),
        flecs.C_POINTER.withName("opaque"),
        flecs.C_POINTER.withName("members"),
        flecs.C_BOOL.withName("is_collection"),
        flecs.C_BOOL.withName("is_empty_scope"),
        flecs.C_BOOL.withName("is_moved_scope"),
        MemoryLayout.paddingLayout(1),
        flecs.C_INT.withName("elem"),
        flecs.C_INT.withName("elem_count"),
        MemoryLayout.paddingLayout(4)
    ).withName("ecs_meta_scope_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong type$LAYOUT = (OfLong)$LAYOUT.select(groupElement("type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_entity_t type
     * }
     */
    public static final OfLong type$layout() {
        return type$LAYOUT;
    }

    private static final long type$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_entity_t type
     * }
     */
    public static final long type$offset() {
        return type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_entity_t type
     * }
     */
    public static long type(MemorySegment struct) {
        return struct.get(type$LAYOUT, type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_entity_t type
     * }
     */
    public static void type(MemorySegment struct, long fieldValue) {
        struct.set(type$LAYOUT, type$OFFSET, fieldValue);
    }

    private static final AddressLayout ops$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ops"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_meta_op_t *ops
     * }
     */
    public static final AddressLayout ops$layout() {
        return ops$LAYOUT;
    }

    private static final long ops$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_meta_op_t *ops
     * }
     */
    public static final long ops$offset() {
        return ops$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_meta_op_t *ops
     * }
     */
    public static MemorySegment ops(MemorySegment struct) {
        return struct.get(ops$LAYOUT, ops$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_meta_op_t *ops
     * }
     */
    public static void ops(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(ops$LAYOUT, ops$OFFSET, fieldValue);
    }

    private static final OfShort ops_count$LAYOUT = (OfShort)$LAYOUT.select(groupElement("ops_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int16_t ops_count
     * }
     */
    public static final OfShort ops_count$layout() {
        return ops_count$LAYOUT;
    }

    private static final long ops_count$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int16_t ops_count
     * }
     */
    public static final long ops_count$offset() {
        return ops_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int16_t ops_count
     * }
     */
    public static short ops_count(MemorySegment struct) {
        return struct.get(ops_count$LAYOUT, ops_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int16_t ops_count
     * }
     */
    public static void ops_count(MemorySegment struct, short fieldValue) {
        struct.set(ops_count$LAYOUT, ops_count$OFFSET, fieldValue);
    }

    private static final OfShort ops_cur$LAYOUT = (OfShort)$LAYOUT.select(groupElement("ops_cur"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int16_t ops_cur
     * }
     */
    public static final OfShort ops_cur$layout() {
        return ops_cur$LAYOUT;
    }

    private static final long ops_cur$OFFSET = 18;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int16_t ops_cur
     * }
     */
    public static final long ops_cur$offset() {
        return ops_cur$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int16_t ops_cur
     * }
     */
    public static short ops_cur(MemorySegment struct) {
        return struct.get(ops_cur$LAYOUT, ops_cur$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int16_t ops_cur
     * }
     */
    public static void ops_cur(MemorySegment struct, short fieldValue) {
        struct.set(ops_cur$LAYOUT, ops_cur$OFFSET, fieldValue);
    }

    private static final OfShort prev_depth$LAYOUT = (OfShort)$LAYOUT.select(groupElement("prev_depth"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int16_t prev_depth
     * }
     */
    public static final OfShort prev_depth$layout() {
        return prev_depth$LAYOUT;
    }

    private static final long prev_depth$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int16_t prev_depth
     * }
     */
    public static final long prev_depth$offset() {
        return prev_depth$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int16_t prev_depth
     * }
     */
    public static short prev_depth(MemorySegment struct) {
        return struct.get(prev_depth$LAYOUT, prev_depth$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int16_t prev_depth
     * }
     */
    public static void prev_depth(MemorySegment struct, short fieldValue) {
        struct.set(prev_depth$LAYOUT, prev_depth$OFFSET, fieldValue);
    }

    private static final AddressLayout ptr$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ptr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *ptr
     * }
     */
    public static final AddressLayout ptr$layout() {
        return ptr$LAYOUT;
    }

    private static final long ptr$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *ptr
     * }
     */
    public static final long ptr$offset() {
        return ptr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *ptr
     * }
     */
    public static MemorySegment ptr(MemorySegment struct) {
        return struct.get(ptr$LAYOUT, ptr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *ptr
     * }
     */
    public static void ptr(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(ptr$LAYOUT, ptr$OFFSET, fieldValue);
    }

    private static final AddressLayout opaque$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("opaque"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const EcsOpaque *opaque
     * }
     */
    public static final AddressLayout opaque$layout() {
        return opaque$LAYOUT;
    }

    private static final long opaque$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const EcsOpaque *opaque
     * }
     */
    public static final long opaque$offset() {
        return opaque$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const EcsOpaque *opaque
     * }
     */
    public static MemorySegment opaque(MemorySegment struct) {
        return struct.get(opaque$LAYOUT, opaque$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const EcsOpaque *opaque
     * }
     */
    public static void opaque(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(opaque$LAYOUT, opaque$OFFSET, fieldValue);
    }

    private static final AddressLayout members$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("members"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_hashmap_t *members
     * }
     */
    public static final AddressLayout members$layout() {
        return members$LAYOUT;
    }

    private static final long members$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_hashmap_t *members
     * }
     */
    public static final long members$offset() {
        return members$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_hashmap_t *members
     * }
     */
    public static MemorySegment members(MemorySegment struct) {
        return struct.get(members$LAYOUT, members$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_hashmap_t *members
     * }
     */
    public static void members(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(members$LAYOUT, members$OFFSET, fieldValue);
    }

    private static final OfBoolean is_collection$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("is_collection"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool is_collection
     * }
     */
    public static final OfBoolean is_collection$layout() {
        return is_collection$LAYOUT;
    }

    private static final long is_collection$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool is_collection
     * }
     */
    public static final long is_collection$offset() {
        return is_collection$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool is_collection
     * }
     */
    public static boolean is_collection(MemorySegment struct) {
        return struct.get(is_collection$LAYOUT, is_collection$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool is_collection
     * }
     */
    public static void is_collection(MemorySegment struct, boolean fieldValue) {
        struct.set(is_collection$LAYOUT, is_collection$OFFSET, fieldValue);
    }

    private static final OfBoolean is_empty_scope$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("is_empty_scope"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool is_empty_scope
     * }
     */
    public static final OfBoolean is_empty_scope$layout() {
        return is_empty_scope$LAYOUT;
    }

    private static final long is_empty_scope$OFFSET = 49;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool is_empty_scope
     * }
     */
    public static final long is_empty_scope$offset() {
        return is_empty_scope$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool is_empty_scope
     * }
     */
    public static boolean is_empty_scope(MemorySegment struct) {
        return struct.get(is_empty_scope$LAYOUT, is_empty_scope$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool is_empty_scope
     * }
     */
    public static void is_empty_scope(MemorySegment struct, boolean fieldValue) {
        struct.set(is_empty_scope$LAYOUT, is_empty_scope$OFFSET, fieldValue);
    }

    private static final OfBoolean is_moved_scope$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("is_moved_scope"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool is_moved_scope
     * }
     */
    public static final OfBoolean is_moved_scope$layout() {
        return is_moved_scope$LAYOUT;
    }

    private static final long is_moved_scope$OFFSET = 50;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool is_moved_scope
     * }
     */
    public static final long is_moved_scope$offset() {
        return is_moved_scope$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool is_moved_scope
     * }
     */
    public static boolean is_moved_scope(MemorySegment struct) {
        return struct.get(is_moved_scope$LAYOUT, is_moved_scope$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool is_moved_scope
     * }
     */
    public static void is_moved_scope(MemorySegment struct, boolean fieldValue) {
        struct.set(is_moved_scope$LAYOUT, is_moved_scope$OFFSET, fieldValue);
    }

    private static final OfInt elem$LAYOUT = (OfInt)$LAYOUT.select(groupElement("elem"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t elem
     * }
     */
    public static final OfInt elem$layout() {
        return elem$LAYOUT;
    }

    private static final long elem$OFFSET = 52;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t elem
     * }
     */
    public static final long elem$offset() {
        return elem$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t elem
     * }
     */
    public static int elem(MemorySegment struct) {
        return struct.get(elem$LAYOUT, elem$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t elem
     * }
     */
    public static void elem(MemorySegment struct, int fieldValue) {
        struct.set(elem$LAYOUT, elem$OFFSET, fieldValue);
    }

    private static final OfInt elem_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("elem_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t elem_count
     * }
     */
    public static final OfInt elem_count$layout() {
        return elem_count$LAYOUT;
    }

    private static final long elem_count$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t elem_count
     * }
     */
    public static final long elem_count$offset() {
        return elem_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t elem_count
     * }
     */
    public static int elem_count(MemorySegment struct) {
        return struct.get(elem_count$LAYOUT, elem_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t elem_count
     * }
     */
    public static void elem_count(MemorySegment struct, int fieldValue) {
        struct.set(elem_count$LAYOUT, elem_count$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

