// Generated by jextract

package org.vybe.flecs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     ecs_world_t *world;
 *     ecs_http_server_t *srv;
 *     int32_t rc;
 *     ecs_map_t cmd_captures;
 *     double last_time;
 * }
 * }
 */
public class ecs_rest_ctx_t {

    ecs_rest_ctx_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        flecs.C_POINTER.withName("world"),
        flecs.C_POINTER.withName("srv"),
        flecs.C_INT.withName("rc"),
        MemoryLayout.paddingLayout(4),
        ecs_map_t.layout().withName("cmd_captures"),
        flecs.C_DOUBLE.withName("last_time")
    ).withName("$anon$12139:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout world$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("world"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_world_t *world
     * }
     */
    public static final AddressLayout world$layout() {
        return world$LAYOUT;
    }

    private static final long world$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_world_t *world
     * }
     */
    public static final long world$offset() {
        return world$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_world_t *world
     * }
     */
    public static MemorySegment world(MemorySegment struct) {
        return struct.get(world$LAYOUT, world$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_world_t *world
     * }
     */
    public static void world(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(world$LAYOUT, world$OFFSET, fieldValue);
    }

    private static final AddressLayout srv$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("srv"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_http_server_t *srv
     * }
     */
    public static final AddressLayout srv$layout() {
        return srv$LAYOUT;
    }

    private static final long srv$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_http_server_t *srv
     * }
     */
    public static final long srv$offset() {
        return srv$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_http_server_t *srv
     * }
     */
    public static MemorySegment srv(MemorySegment struct) {
        return struct.get(srv$LAYOUT, srv$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_http_server_t *srv
     * }
     */
    public static void srv(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(srv$LAYOUT, srv$OFFSET, fieldValue);
    }

    private static final OfInt rc$LAYOUT = (OfInt)$LAYOUT.select(groupElement("rc"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t rc
     * }
     */
    public static final OfInt rc$layout() {
        return rc$LAYOUT;
    }

    private static final long rc$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t rc
     * }
     */
    public static final long rc$offset() {
        return rc$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t rc
     * }
     */
    public static int rc(MemorySegment struct) {
        return struct.get(rc$LAYOUT, rc$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t rc
     * }
     */
    public static void rc(MemorySegment struct, int fieldValue) {
        struct.set(rc$LAYOUT, rc$OFFSET, fieldValue);
    }

    private static final GroupLayout cmd_captures$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("cmd_captures"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_map_t cmd_captures
     * }
     */
    public static final GroupLayout cmd_captures$layout() {
        return cmd_captures$LAYOUT;
    }

    private static final long cmd_captures$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_map_t cmd_captures
     * }
     */
    public static final long cmd_captures$offset() {
        return cmd_captures$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_map_t cmd_captures
     * }
     */
    public static MemorySegment cmd_captures(MemorySegment struct) {
        return struct.asSlice(cmd_captures$OFFSET, cmd_captures$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_map_t cmd_captures
     * }
     */
    public static void cmd_captures(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, cmd_captures$OFFSET, cmd_captures$LAYOUT.byteSize());
    }

    private static final OfDouble last_time$LAYOUT = (OfDouble)$LAYOUT.select(groupElement("last_time"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double last_time
     * }
     */
    public static final OfDouble last_time$layout() {
        return last_time$LAYOUT;
    }

    private static final long last_time$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double last_time
     * }
     */
    public static final long last_time$offset() {
        return last_time$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double last_time
     * }
     */
    public static double last_time(MemorySegment struct) {
        return struct.get(last_time$LAYOUT, last_time$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double last_time
     * }
     */
    public static void last_time(MemorySegment struct, double fieldValue) {
        struct.set(last_time$LAYOUT, last_time$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

