// Generated by jextract

package org.vybe.flecs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ecs_query_iter_t {
 *     struct ecs_var_t *vars;
 *     const struct ecs_query_var_t *query_vars;
 *     const struct ecs_query_op_t *ops;
 *     struct ecs_query_op_ctx_t *op_ctx;
 *     uint64_t *written;
 *     ecs_query_cache_group_t *group;
 *     ecs_vec_t *tables;
 *     ecs_vec_t *all_tables;
 *     ecs_query_cache_match_t *elem;
 *     int32_t cur;
 *     int32_t all_cur;
 *     ecs_query_op_profile_t *profile;
 *     int16_t op;
 *     bool iter_single_group;
 * }
 * }
 */
public class ecs_query_iter_t {

    ecs_query_iter_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        flecs.C_POINTER.withName("vars"),
        flecs.C_POINTER.withName("query_vars"),
        flecs.C_POINTER.withName("ops"),
        flecs.C_POINTER.withName("op_ctx"),
        flecs.C_POINTER.withName("written"),
        flecs.C_POINTER.withName("group"),
        flecs.C_POINTER.withName("tables"),
        flecs.C_POINTER.withName("all_tables"),
        flecs.C_POINTER.withName("elem"),
        flecs.C_INT.withName("cur"),
        flecs.C_INT.withName("all_cur"),
        flecs.C_POINTER.withName("profile"),
        flecs.C_SHORT.withName("op"),
        flecs.C_BOOL.withName("iter_single_group"),
        MemoryLayout.paddingLayout(5)
    ).withName("ecs_query_iter_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout vars$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("vars"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ecs_var_t *vars
     * }
     */
    public static final AddressLayout vars$layout() {
        return vars$LAYOUT;
    }

    private static final long vars$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ecs_var_t *vars
     * }
     */
    public static final long vars$offset() {
        return vars$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ecs_var_t *vars
     * }
     */
    public static MemorySegment vars(MemorySegment struct) {
        return struct.get(vars$LAYOUT, vars$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ecs_var_t *vars
     * }
     */
    public static void vars(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(vars$LAYOUT, vars$OFFSET, fieldValue);
    }

    private static final AddressLayout query_vars$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("query_vars"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const struct ecs_query_var_t *query_vars
     * }
     */
    public static final AddressLayout query_vars$layout() {
        return query_vars$LAYOUT;
    }

    private static final long query_vars$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const struct ecs_query_var_t *query_vars
     * }
     */
    public static final long query_vars$offset() {
        return query_vars$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const struct ecs_query_var_t *query_vars
     * }
     */
    public static MemorySegment query_vars(MemorySegment struct) {
        return struct.get(query_vars$LAYOUT, query_vars$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const struct ecs_query_var_t *query_vars
     * }
     */
    public static void query_vars(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(query_vars$LAYOUT, query_vars$OFFSET, fieldValue);
    }

    private static final AddressLayout ops$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("ops"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const struct ecs_query_op_t *ops
     * }
     */
    public static final AddressLayout ops$layout() {
        return ops$LAYOUT;
    }

    private static final long ops$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const struct ecs_query_op_t *ops
     * }
     */
    public static final long ops$offset() {
        return ops$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const struct ecs_query_op_t *ops
     * }
     */
    public static MemorySegment ops(MemorySegment struct) {
        return struct.get(ops$LAYOUT, ops$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const struct ecs_query_op_t *ops
     * }
     */
    public static void ops(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(ops$LAYOUT, ops$OFFSET, fieldValue);
    }

    private static final AddressLayout op_ctx$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("op_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ecs_query_op_ctx_t *op_ctx
     * }
     */
    public static final AddressLayout op_ctx$layout() {
        return op_ctx$LAYOUT;
    }

    private static final long op_ctx$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ecs_query_op_ctx_t *op_ctx
     * }
     */
    public static final long op_ctx$offset() {
        return op_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ecs_query_op_ctx_t *op_ctx
     * }
     */
    public static MemorySegment op_ctx(MemorySegment struct) {
        return struct.get(op_ctx$LAYOUT, op_ctx$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ecs_query_op_ctx_t *op_ctx
     * }
     */
    public static void op_ctx(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(op_ctx$LAYOUT, op_ctx$OFFSET, fieldValue);
    }

    private static final AddressLayout written$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("written"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t *written
     * }
     */
    public static final AddressLayout written$layout() {
        return written$LAYOUT;
    }

    private static final long written$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t *written
     * }
     */
    public static final long written$offset() {
        return written$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t *written
     * }
     */
    public static MemorySegment written(MemorySegment struct) {
        return struct.get(written$LAYOUT, written$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t *written
     * }
     */
    public static void written(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(written$LAYOUT, written$OFFSET, fieldValue);
    }

    private static final AddressLayout group$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("group"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_query_cache_group_t *group
     * }
     */
    public static final AddressLayout group$layout() {
        return group$LAYOUT;
    }

    private static final long group$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_query_cache_group_t *group
     * }
     */
    public static final long group$offset() {
        return group$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_query_cache_group_t *group
     * }
     */
    public static MemorySegment group(MemorySegment struct) {
        return struct.get(group$LAYOUT, group$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_query_cache_group_t *group
     * }
     */
    public static void group(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(group$LAYOUT, group$OFFSET, fieldValue);
    }

    private static final AddressLayout tables$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("tables"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_vec_t *tables
     * }
     */
    public static final AddressLayout tables$layout() {
        return tables$LAYOUT;
    }

    private static final long tables$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_vec_t *tables
     * }
     */
    public static final long tables$offset() {
        return tables$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_vec_t *tables
     * }
     */
    public static MemorySegment tables(MemorySegment struct) {
        return struct.get(tables$LAYOUT, tables$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_vec_t *tables
     * }
     */
    public static void tables(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(tables$LAYOUT, tables$OFFSET, fieldValue);
    }

    private static final AddressLayout all_tables$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("all_tables"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_vec_t *all_tables
     * }
     */
    public static final AddressLayout all_tables$layout() {
        return all_tables$LAYOUT;
    }

    private static final long all_tables$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_vec_t *all_tables
     * }
     */
    public static final long all_tables$offset() {
        return all_tables$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_vec_t *all_tables
     * }
     */
    public static MemorySegment all_tables(MemorySegment struct) {
        return struct.get(all_tables$LAYOUT, all_tables$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_vec_t *all_tables
     * }
     */
    public static void all_tables(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(all_tables$LAYOUT, all_tables$OFFSET, fieldValue);
    }

    private static final AddressLayout elem$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("elem"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_query_cache_match_t *elem
     * }
     */
    public static final AddressLayout elem$layout() {
        return elem$LAYOUT;
    }

    private static final long elem$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_query_cache_match_t *elem
     * }
     */
    public static final long elem$offset() {
        return elem$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_query_cache_match_t *elem
     * }
     */
    public static MemorySegment elem(MemorySegment struct) {
        return struct.get(elem$LAYOUT, elem$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_query_cache_match_t *elem
     * }
     */
    public static void elem(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(elem$LAYOUT, elem$OFFSET, fieldValue);
    }

    private static final OfInt cur$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cur"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t cur
     * }
     */
    public static final OfInt cur$layout() {
        return cur$LAYOUT;
    }

    private static final long cur$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t cur
     * }
     */
    public static final long cur$offset() {
        return cur$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t cur
     * }
     */
    public static int cur(MemorySegment struct) {
        return struct.get(cur$LAYOUT, cur$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t cur
     * }
     */
    public static void cur(MemorySegment struct, int fieldValue) {
        struct.set(cur$LAYOUT, cur$OFFSET, fieldValue);
    }

    private static final OfInt all_cur$LAYOUT = (OfInt)$LAYOUT.select(groupElement("all_cur"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t all_cur
     * }
     */
    public static final OfInt all_cur$layout() {
        return all_cur$LAYOUT;
    }

    private static final long all_cur$OFFSET = 76;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t all_cur
     * }
     */
    public static final long all_cur$offset() {
        return all_cur$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t all_cur
     * }
     */
    public static int all_cur(MemorySegment struct) {
        return struct.get(all_cur$LAYOUT, all_cur$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t all_cur
     * }
     */
    public static void all_cur(MemorySegment struct, int fieldValue) {
        struct.set(all_cur$LAYOUT, all_cur$OFFSET, fieldValue);
    }

    private static final AddressLayout profile$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("profile"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_query_op_profile_t *profile
     * }
     */
    public static final AddressLayout profile$layout() {
        return profile$LAYOUT;
    }

    private static final long profile$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_query_op_profile_t *profile
     * }
     */
    public static final long profile$offset() {
        return profile$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_query_op_profile_t *profile
     * }
     */
    public static MemorySegment profile(MemorySegment struct) {
        return struct.get(profile$LAYOUT, profile$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_query_op_profile_t *profile
     * }
     */
    public static void profile(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(profile$LAYOUT, profile$OFFSET, fieldValue);
    }

    private static final OfShort op$LAYOUT = (OfShort)$LAYOUT.select(groupElement("op"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int16_t op
     * }
     */
    public static final OfShort op$layout() {
        return op$LAYOUT;
    }

    private static final long op$OFFSET = 88;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int16_t op
     * }
     */
    public static final long op$offset() {
        return op$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int16_t op
     * }
     */
    public static short op(MemorySegment struct) {
        return struct.get(op$LAYOUT, op$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int16_t op
     * }
     */
    public static void op(MemorySegment struct, short fieldValue) {
        struct.set(op$LAYOUT, op$OFFSET, fieldValue);
    }

    private static final OfBoolean iter_single_group$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("iter_single_group"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool iter_single_group
     * }
     */
    public static final OfBoolean iter_single_group$layout() {
        return iter_single_group$LAYOUT;
    }

    private static final long iter_single_group$OFFSET = 90;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool iter_single_group
     * }
     */
    public static final long iter_single_group$offset() {
        return iter_single_group$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool iter_single_group
     * }
     */
    public static boolean iter_single_group(MemorySegment struct) {
        return struct.get(iter_single_group$LAYOUT, iter_single_group$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool iter_single_group
     * }
     */
    public static void iter_single_group(MemorySegment struct, boolean fieldValue) {
        struct.set(iter_single_group$LAYOUT, iter_single_group$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

