// Generated by jextract

package org.vybe.flecs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     ecs_size_t bytes_graph_edge;
 *     ecs_size_t bytes_component_record;
 *     ecs_size_t bytes_pair_record;
 *     ecs_size_t bytes_table_diff;
 *     ecs_size_t bytes_sparse_chunk;
 *     ecs_size_t bytes_allocator;
 *     ecs_size_t bytes_stack_allocator;
 *     ecs_size_t bytes_cmd_entry_chunk;
 *     ecs_size_t bytes_query_impl;
 *     ecs_size_t bytes_query_cache;
 *     ecs_size_t bytes_misc;
 * }
 * }
 */
public class ecs_allocator_memory_t {

    ecs_allocator_memory_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        flecs.C_INT.withName("bytes_graph_edge"),
        flecs.C_INT.withName("bytes_component_record"),
        flecs.C_INT.withName("bytes_pair_record"),
        flecs.C_INT.withName("bytes_table_diff"),
        flecs.C_INT.withName("bytes_sparse_chunk"),
        flecs.C_INT.withName("bytes_allocator"),
        flecs.C_INT.withName("bytes_stack_allocator"),
        flecs.C_INT.withName("bytes_cmd_entry_chunk"),
        flecs.C_INT.withName("bytes_query_impl"),
        flecs.C_INT.withName("bytes_query_cache"),
        flecs.C_INT.withName("bytes_misc")
    ).withName("$anon$13715:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt bytes_graph_edge$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_graph_edge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_graph_edge
     * }
     */
    public static final OfInt bytes_graph_edge$layout() {
        return bytes_graph_edge$LAYOUT;
    }

    private static final long bytes_graph_edge$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_graph_edge
     * }
     */
    public static final long bytes_graph_edge$offset() {
        return bytes_graph_edge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_graph_edge
     * }
     */
    public static int bytes_graph_edge(MemorySegment struct) {
        return struct.get(bytes_graph_edge$LAYOUT, bytes_graph_edge$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_graph_edge
     * }
     */
    public static void bytes_graph_edge(MemorySegment struct, int fieldValue) {
        struct.set(bytes_graph_edge$LAYOUT, bytes_graph_edge$OFFSET, fieldValue);
    }

    private static final OfInt bytes_component_record$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_component_record"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_record
     * }
     */
    public static final OfInt bytes_component_record$layout() {
        return bytes_component_record$LAYOUT;
    }

    private static final long bytes_component_record$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_record
     * }
     */
    public static final long bytes_component_record$offset() {
        return bytes_component_record$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_record
     * }
     */
    public static int bytes_component_record(MemorySegment struct) {
        return struct.get(bytes_component_record$LAYOUT, bytes_component_record$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_record
     * }
     */
    public static void bytes_component_record(MemorySegment struct, int fieldValue) {
        struct.set(bytes_component_record$LAYOUT, bytes_component_record$OFFSET, fieldValue);
    }

    private static final OfInt bytes_pair_record$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_pair_record"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_pair_record
     * }
     */
    public static final OfInt bytes_pair_record$layout() {
        return bytes_pair_record$LAYOUT;
    }

    private static final long bytes_pair_record$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_pair_record
     * }
     */
    public static final long bytes_pair_record$offset() {
        return bytes_pair_record$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_pair_record
     * }
     */
    public static int bytes_pair_record(MemorySegment struct) {
        return struct.get(bytes_pair_record$LAYOUT, bytes_pair_record$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_pair_record
     * }
     */
    public static void bytes_pair_record(MemorySegment struct, int fieldValue) {
        struct.set(bytes_pair_record$LAYOUT, bytes_pair_record$OFFSET, fieldValue);
    }

    private static final OfInt bytes_table_diff$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_table_diff"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_diff
     * }
     */
    public static final OfInt bytes_table_diff$layout() {
        return bytes_table_diff$LAYOUT;
    }

    private static final long bytes_table_diff$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_diff
     * }
     */
    public static final long bytes_table_diff$offset() {
        return bytes_table_diff$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_diff
     * }
     */
    public static int bytes_table_diff(MemorySegment struct) {
        return struct.get(bytes_table_diff$LAYOUT, bytes_table_diff$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_diff
     * }
     */
    public static void bytes_table_diff(MemorySegment struct, int fieldValue) {
        struct.set(bytes_table_diff$LAYOUT, bytes_table_diff$OFFSET, fieldValue);
    }

    private static final OfInt bytes_sparse_chunk$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_sparse_chunk"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_sparse_chunk
     * }
     */
    public static final OfInt bytes_sparse_chunk$layout() {
        return bytes_sparse_chunk$LAYOUT;
    }

    private static final long bytes_sparse_chunk$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_sparse_chunk
     * }
     */
    public static final long bytes_sparse_chunk$offset() {
        return bytes_sparse_chunk$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_sparse_chunk
     * }
     */
    public static int bytes_sparse_chunk(MemorySegment struct) {
        return struct.get(bytes_sparse_chunk$LAYOUT, bytes_sparse_chunk$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_sparse_chunk
     * }
     */
    public static void bytes_sparse_chunk(MemorySegment struct, int fieldValue) {
        struct.set(bytes_sparse_chunk$LAYOUT, bytes_sparse_chunk$OFFSET, fieldValue);
    }

    private static final OfInt bytes_allocator$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_allocator"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_allocator
     * }
     */
    public static final OfInt bytes_allocator$layout() {
        return bytes_allocator$LAYOUT;
    }

    private static final long bytes_allocator$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_allocator
     * }
     */
    public static final long bytes_allocator$offset() {
        return bytes_allocator$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_allocator
     * }
     */
    public static int bytes_allocator(MemorySegment struct) {
        return struct.get(bytes_allocator$LAYOUT, bytes_allocator$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_allocator
     * }
     */
    public static void bytes_allocator(MemorySegment struct, int fieldValue) {
        struct.set(bytes_allocator$LAYOUT, bytes_allocator$OFFSET, fieldValue);
    }

    private static final OfInt bytes_stack_allocator$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_stack_allocator"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_stack_allocator
     * }
     */
    public static final OfInt bytes_stack_allocator$layout() {
        return bytes_stack_allocator$LAYOUT;
    }

    private static final long bytes_stack_allocator$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_stack_allocator
     * }
     */
    public static final long bytes_stack_allocator$offset() {
        return bytes_stack_allocator$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_stack_allocator
     * }
     */
    public static int bytes_stack_allocator(MemorySegment struct) {
        return struct.get(bytes_stack_allocator$LAYOUT, bytes_stack_allocator$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_stack_allocator
     * }
     */
    public static void bytes_stack_allocator(MemorySegment struct, int fieldValue) {
        struct.set(bytes_stack_allocator$LAYOUT, bytes_stack_allocator$OFFSET, fieldValue);
    }

    private static final OfInt bytes_cmd_entry_chunk$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_cmd_entry_chunk"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_cmd_entry_chunk
     * }
     */
    public static final OfInt bytes_cmd_entry_chunk$layout() {
        return bytes_cmd_entry_chunk$LAYOUT;
    }

    private static final long bytes_cmd_entry_chunk$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_cmd_entry_chunk
     * }
     */
    public static final long bytes_cmd_entry_chunk$offset() {
        return bytes_cmd_entry_chunk$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_cmd_entry_chunk
     * }
     */
    public static int bytes_cmd_entry_chunk(MemorySegment struct) {
        return struct.get(bytes_cmd_entry_chunk$LAYOUT, bytes_cmd_entry_chunk$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_cmd_entry_chunk
     * }
     */
    public static void bytes_cmd_entry_chunk(MemorySegment struct, int fieldValue) {
        struct.set(bytes_cmd_entry_chunk$LAYOUT, bytes_cmd_entry_chunk$OFFSET, fieldValue);
    }

    private static final OfInt bytes_query_impl$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_query_impl"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_query_impl
     * }
     */
    public static final OfInt bytes_query_impl$layout() {
        return bytes_query_impl$LAYOUT;
    }

    private static final long bytes_query_impl$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_query_impl
     * }
     */
    public static final long bytes_query_impl$offset() {
        return bytes_query_impl$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_query_impl
     * }
     */
    public static int bytes_query_impl(MemorySegment struct) {
        return struct.get(bytes_query_impl$LAYOUT, bytes_query_impl$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_query_impl
     * }
     */
    public static void bytes_query_impl(MemorySegment struct, int fieldValue) {
        struct.set(bytes_query_impl$LAYOUT, bytes_query_impl$OFFSET, fieldValue);
    }

    private static final OfInt bytes_query_cache$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_query_cache"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_query_cache
     * }
     */
    public static final OfInt bytes_query_cache$layout() {
        return bytes_query_cache$LAYOUT;
    }

    private static final long bytes_query_cache$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_query_cache
     * }
     */
    public static final long bytes_query_cache$offset() {
        return bytes_query_cache$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_query_cache
     * }
     */
    public static int bytes_query_cache(MemorySegment struct) {
        return struct.get(bytes_query_cache$LAYOUT, bytes_query_cache$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_query_cache
     * }
     */
    public static void bytes_query_cache(MemorySegment struct, int fieldValue) {
        struct.set(bytes_query_cache$LAYOUT, bytes_query_cache$OFFSET, fieldValue);
    }

    private static final OfInt bytes_misc$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_misc"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_misc
     * }
     */
    public static final OfInt bytes_misc$layout() {
        return bytes_misc$LAYOUT;
    }

    private static final long bytes_misc$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_misc
     * }
     */
    public static final long bytes_misc$offset() {
        return bytes_misc$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_misc
     * }
     */
    public static int bytes_misc(MemorySegment struct) {
        return struct.get(bytes_misc$LAYOUT, bytes_misc$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_misc
     * }
     */
    public static void bytes_misc(MemorySegment struct, int fieldValue) {
        struct.set(bytes_misc$LAYOUT, bytes_misc$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

