// Generated by jextract

package org.vybe.flecs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int32_t alive_count;
 *     int32_t not_alive_count;
 *     ecs_size_t bytes_entity_index;
 *     ecs_size_t bytes_names;
 *     ecs_size_t bytes_doc_strings;
 * }
 * }
 */
public class ecs_entities_memory_t {

    ecs_entities_memory_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        flecs.C_INT.withName("alive_count"),
        flecs.C_INT.withName("not_alive_count"),
        flecs.C_INT.withName("bytes_entity_index"),
        flecs.C_INT.withName("bytes_names"),
        flecs.C_INT.withName("bytes_doc_strings")
    ).withName("$anon$13630:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt alive_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("alive_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t alive_count
     * }
     */
    public static final OfInt alive_count$layout() {
        return alive_count$LAYOUT;
    }

    private static final long alive_count$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t alive_count
     * }
     */
    public static final long alive_count$offset() {
        return alive_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t alive_count
     * }
     */
    public static int alive_count(MemorySegment struct) {
        return struct.get(alive_count$LAYOUT, alive_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t alive_count
     * }
     */
    public static void alive_count(MemorySegment struct, int fieldValue) {
        struct.set(alive_count$LAYOUT, alive_count$OFFSET, fieldValue);
    }

    private static final OfInt not_alive_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("not_alive_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t not_alive_count
     * }
     */
    public static final OfInt not_alive_count$layout() {
        return not_alive_count$LAYOUT;
    }

    private static final long not_alive_count$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t not_alive_count
     * }
     */
    public static final long not_alive_count$offset() {
        return not_alive_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t not_alive_count
     * }
     */
    public static int not_alive_count(MemorySegment struct) {
        return struct.get(not_alive_count$LAYOUT, not_alive_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t not_alive_count
     * }
     */
    public static void not_alive_count(MemorySegment struct, int fieldValue) {
        struct.set(not_alive_count$LAYOUT, not_alive_count$OFFSET, fieldValue);
    }

    private static final OfInt bytes_entity_index$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_entity_index"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_entity_index
     * }
     */
    public static final OfInt bytes_entity_index$layout() {
        return bytes_entity_index$LAYOUT;
    }

    private static final long bytes_entity_index$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_entity_index
     * }
     */
    public static final long bytes_entity_index$offset() {
        return bytes_entity_index$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_entity_index
     * }
     */
    public static int bytes_entity_index(MemorySegment struct) {
        return struct.get(bytes_entity_index$LAYOUT, bytes_entity_index$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_entity_index
     * }
     */
    public static void bytes_entity_index(MemorySegment struct, int fieldValue) {
        struct.set(bytes_entity_index$LAYOUT, bytes_entity_index$OFFSET, fieldValue);
    }

    private static final OfInt bytes_names$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_names"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_names
     * }
     */
    public static final OfInt bytes_names$layout() {
        return bytes_names$LAYOUT;
    }

    private static final long bytes_names$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_names
     * }
     */
    public static final long bytes_names$offset() {
        return bytes_names$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_names
     * }
     */
    public static int bytes_names(MemorySegment struct) {
        return struct.get(bytes_names$LAYOUT, bytes_names$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_names
     * }
     */
    public static void bytes_names(MemorySegment struct, int fieldValue) {
        struct.set(bytes_names$LAYOUT, bytes_names$OFFSET, fieldValue);
    }

    private static final OfInt bytes_doc_strings$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_doc_strings"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_doc_strings
     * }
     */
    public static final OfInt bytes_doc_strings$layout() {
        return bytes_doc_strings$LAYOUT;
    }

    private static final long bytes_doc_strings$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_doc_strings
     * }
     */
    public static final long bytes_doc_strings$offset() {
        return bytes_doc_strings$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_doc_strings
     * }
     */
    public static int bytes_doc_strings(MemorySegment struct) {
        return struct.get(bytes_doc_strings$LAYOUT, bytes_doc_strings$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_doc_strings
     * }
     */
    public static void bytes_doc_strings(MemorySegment struct, int fieldValue) {
        struct.set(bytes_doc_strings$LAYOUT, bytes_doc_strings$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

