// Generated by jextract

package org.vybe.flecs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     ecs_size_t bytes_world;
 *     ecs_size_t bytes_observers;
 *     ecs_size_t bytes_systems;
 *     ecs_size_t bytes_pipelines;
 *     ecs_size_t bytes_table_lookup;
 *     ecs_size_t bytes_component_record_lookup;
 *     ecs_size_t bytes_type_info;
 *     ecs_size_t bytes_commands;
 *     ecs_size_t bytes_rematch_monitor;
 *     ecs_size_t bytes_component_ids;
 *     ecs_size_t bytes_reflection;
 *     ecs_size_t bytes_stats;
 *     ecs_size_t bytes_rest;
 * }
 * }
 */
public class ecs_misc_memory_t {

    ecs_misc_memory_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        flecs.C_INT.withName("bytes_world"),
        flecs.C_INT.withName("bytes_observers"),
        flecs.C_INT.withName("bytes_systems"),
        flecs.C_INT.withName("bytes_pipelines"),
        flecs.C_INT.withName("bytes_table_lookup"),
        flecs.C_INT.withName("bytes_component_record_lookup"),
        flecs.C_INT.withName("bytes_type_info"),
        flecs.C_INT.withName("bytes_commands"),
        flecs.C_INT.withName("bytes_rematch_monitor"),
        flecs.C_INT.withName("bytes_component_ids"),
        flecs.C_INT.withName("bytes_reflection"),
        flecs.C_INT.withName("bytes_stats"),
        flecs.C_INT.withName("bytes_rest")
    ).withName("$anon$13697:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt bytes_world$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_world"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_world
     * }
     */
    public static final OfInt bytes_world$layout() {
        return bytes_world$LAYOUT;
    }

    private static final long bytes_world$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_world
     * }
     */
    public static final long bytes_world$offset() {
        return bytes_world$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_world
     * }
     */
    public static int bytes_world(MemorySegment struct) {
        return struct.get(bytes_world$LAYOUT, bytes_world$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_world
     * }
     */
    public static void bytes_world(MemorySegment struct, int fieldValue) {
        struct.set(bytes_world$LAYOUT, bytes_world$OFFSET, fieldValue);
    }

    private static final OfInt bytes_observers$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_observers"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_observers
     * }
     */
    public static final OfInt bytes_observers$layout() {
        return bytes_observers$LAYOUT;
    }

    private static final long bytes_observers$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_observers
     * }
     */
    public static final long bytes_observers$offset() {
        return bytes_observers$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_observers
     * }
     */
    public static int bytes_observers(MemorySegment struct) {
        return struct.get(bytes_observers$LAYOUT, bytes_observers$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_observers
     * }
     */
    public static void bytes_observers(MemorySegment struct, int fieldValue) {
        struct.set(bytes_observers$LAYOUT, bytes_observers$OFFSET, fieldValue);
    }

    private static final OfInt bytes_systems$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_systems"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_systems
     * }
     */
    public static final OfInt bytes_systems$layout() {
        return bytes_systems$LAYOUT;
    }

    private static final long bytes_systems$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_systems
     * }
     */
    public static final long bytes_systems$offset() {
        return bytes_systems$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_systems
     * }
     */
    public static int bytes_systems(MemorySegment struct) {
        return struct.get(bytes_systems$LAYOUT, bytes_systems$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_systems
     * }
     */
    public static void bytes_systems(MemorySegment struct, int fieldValue) {
        struct.set(bytes_systems$LAYOUT, bytes_systems$OFFSET, fieldValue);
    }

    private static final OfInt bytes_pipelines$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_pipelines"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_pipelines
     * }
     */
    public static final OfInt bytes_pipelines$layout() {
        return bytes_pipelines$LAYOUT;
    }

    private static final long bytes_pipelines$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_pipelines
     * }
     */
    public static final long bytes_pipelines$offset() {
        return bytes_pipelines$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_pipelines
     * }
     */
    public static int bytes_pipelines(MemorySegment struct) {
        return struct.get(bytes_pipelines$LAYOUT, bytes_pipelines$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_pipelines
     * }
     */
    public static void bytes_pipelines(MemorySegment struct, int fieldValue) {
        struct.set(bytes_pipelines$LAYOUT, bytes_pipelines$OFFSET, fieldValue);
    }

    private static final OfInt bytes_table_lookup$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_table_lookup"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_lookup
     * }
     */
    public static final OfInt bytes_table_lookup$layout() {
        return bytes_table_lookup$LAYOUT;
    }

    private static final long bytes_table_lookup$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_lookup
     * }
     */
    public static final long bytes_table_lookup$offset() {
        return bytes_table_lookup$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_lookup
     * }
     */
    public static int bytes_table_lookup(MemorySegment struct) {
        return struct.get(bytes_table_lookup$LAYOUT, bytes_table_lookup$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_lookup
     * }
     */
    public static void bytes_table_lookup(MemorySegment struct, int fieldValue) {
        struct.set(bytes_table_lookup$LAYOUT, bytes_table_lookup$OFFSET, fieldValue);
    }

    private static final OfInt bytes_component_record_lookup$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_component_record_lookup"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_record_lookup
     * }
     */
    public static final OfInt bytes_component_record_lookup$layout() {
        return bytes_component_record_lookup$LAYOUT;
    }

    private static final long bytes_component_record_lookup$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_record_lookup
     * }
     */
    public static final long bytes_component_record_lookup$offset() {
        return bytes_component_record_lookup$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_record_lookup
     * }
     */
    public static int bytes_component_record_lookup(MemorySegment struct) {
        return struct.get(bytes_component_record_lookup$LAYOUT, bytes_component_record_lookup$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_record_lookup
     * }
     */
    public static void bytes_component_record_lookup(MemorySegment struct, int fieldValue) {
        struct.set(bytes_component_record_lookup$LAYOUT, bytes_component_record_lookup$OFFSET, fieldValue);
    }

    private static final OfInt bytes_type_info$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_type_info"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_type_info
     * }
     */
    public static final OfInt bytes_type_info$layout() {
        return bytes_type_info$LAYOUT;
    }

    private static final long bytes_type_info$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_type_info
     * }
     */
    public static final long bytes_type_info$offset() {
        return bytes_type_info$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_type_info
     * }
     */
    public static int bytes_type_info(MemorySegment struct) {
        return struct.get(bytes_type_info$LAYOUT, bytes_type_info$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_type_info
     * }
     */
    public static void bytes_type_info(MemorySegment struct, int fieldValue) {
        struct.set(bytes_type_info$LAYOUT, bytes_type_info$OFFSET, fieldValue);
    }

    private static final OfInt bytes_commands$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_commands"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_commands
     * }
     */
    public static final OfInt bytes_commands$layout() {
        return bytes_commands$LAYOUT;
    }

    private static final long bytes_commands$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_commands
     * }
     */
    public static final long bytes_commands$offset() {
        return bytes_commands$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_commands
     * }
     */
    public static int bytes_commands(MemorySegment struct) {
        return struct.get(bytes_commands$LAYOUT, bytes_commands$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_commands
     * }
     */
    public static void bytes_commands(MemorySegment struct, int fieldValue) {
        struct.set(bytes_commands$LAYOUT, bytes_commands$OFFSET, fieldValue);
    }

    private static final OfInt bytes_rematch_monitor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_rematch_monitor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_rematch_monitor
     * }
     */
    public static final OfInt bytes_rematch_monitor$layout() {
        return bytes_rematch_monitor$LAYOUT;
    }

    private static final long bytes_rematch_monitor$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_rematch_monitor
     * }
     */
    public static final long bytes_rematch_monitor$offset() {
        return bytes_rematch_monitor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_rematch_monitor
     * }
     */
    public static int bytes_rematch_monitor(MemorySegment struct) {
        return struct.get(bytes_rematch_monitor$LAYOUT, bytes_rematch_monitor$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_rematch_monitor
     * }
     */
    public static void bytes_rematch_monitor(MemorySegment struct, int fieldValue) {
        struct.set(bytes_rematch_monitor$LAYOUT, bytes_rematch_monitor$OFFSET, fieldValue);
    }

    private static final OfInt bytes_component_ids$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_component_ids"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_ids
     * }
     */
    public static final OfInt bytes_component_ids$layout() {
        return bytes_component_ids$LAYOUT;
    }

    private static final long bytes_component_ids$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_ids
     * }
     */
    public static final long bytes_component_ids$offset() {
        return bytes_component_ids$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_ids
     * }
     */
    public static int bytes_component_ids(MemorySegment struct) {
        return struct.get(bytes_component_ids$LAYOUT, bytes_component_ids$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_ids
     * }
     */
    public static void bytes_component_ids(MemorySegment struct, int fieldValue) {
        struct.set(bytes_component_ids$LAYOUT, bytes_component_ids$OFFSET, fieldValue);
    }

    private static final OfInt bytes_reflection$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_reflection"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_reflection
     * }
     */
    public static final OfInt bytes_reflection$layout() {
        return bytes_reflection$LAYOUT;
    }

    private static final long bytes_reflection$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_reflection
     * }
     */
    public static final long bytes_reflection$offset() {
        return bytes_reflection$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_reflection
     * }
     */
    public static int bytes_reflection(MemorySegment struct) {
        return struct.get(bytes_reflection$LAYOUT, bytes_reflection$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_reflection
     * }
     */
    public static void bytes_reflection(MemorySegment struct, int fieldValue) {
        struct.set(bytes_reflection$LAYOUT, bytes_reflection$OFFSET, fieldValue);
    }

    private static final OfInt bytes_stats$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_stats"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_stats
     * }
     */
    public static final OfInt bytes_stats$layout() {
        return bytes_stats$LAYOUT;
    }

    private static final long bytes_stats$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_stats
     * }
     */
    public static final long bytes_stats$offset() {
        return bytes_stats$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_stats
     * }
     */
    public static int bytes_stats(MemorySegment struct) {
        return struct.get(bytes_stats$LAYOUT, bytes_stats$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_stats
     * }
     */
    public static void bytes_stats(MemorySegment struct, int fieldValue) {
        struct.set(bytes_stats$LAYOUT, bytes_stats$OFFSET, fieldValue);
    }

    private static final OfInt bytes_rest$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_rest"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_rest
     * }
     */
    public static final OfInt bytes_rest$layout() {
        return bytes_rest$LAYOUT;
    }

    private static final long bytes_rest$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_rest
     * }
     */
    public static final long bytes_rest$offset() {
        return bytes_rest$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_rest
     * }
     */
    public static int bytes_rest(MemorySegment struct) {
        return struct.get(bytes_rest$LAYOUT, bytes_rest$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_rest
     * }
     */
    public static void bytes_rest(MemorySegment struct, int fieldValue) {
        struct.set(bytes_rest$LAYOUT, bytes_rest$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

