// Generated by jextract

package org.vybe.flecs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int32_t count;
 *     int32_t empty_count;
 *     int32_t column_count;
 *     ecs_size_t bytes_table;
 *     ecs_size_t bytes_type;
 *     ecs_size_t bytes_entities;
 *     ecs_size_t bytes_overrides;
 *     ecs_size_t bytes_columns;
 *     ecs_size_t bytes_table_records;
 *     ecs_size_t bytes_column_map;
 *     ecs_size_t bytes_component_map;
 *     ecs_size_t bytes_dirty_state;
 *     ecs_size_t bytes_edges;
 * }
 * }
 */
public class ecs_table_memory_t {

    ecs_table_memory_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        flecs.C_INT.withName("count"),
        flecs.C_INT.withName("empty_count"),
        flecs.C_INT.withName("column_count"),
        flecs.C_INT.withName("bytes_table"),
        flecs.C_INT.withName("bytes_type"),
        flecs.C_INT.withName("bytes_entities"),
        flecs.C_INT.withName("bytes_overrides"),
        flecs.C_INT.withName("bytes_columns"),
        flecs.C_INT.withName("bytes_table_records"),
        flecs.C_INT.withName("bytes_column_map"),
        flecs.C_INT.withName("bytes_component_map"),
        flecs.C_INT.withName("bytes_dirty_state"),
        flecs.C_INT.withName("bytes_edges")
    ).withName("$anon$13648:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t count
     * }
     */
    public static final OfInt count$layout() {
        return count$LAYOUT;
    }

    private static final long count$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t count
     * }
     */
    public static final long count$offset() {
        return count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t count
     * }
     */
    public static int count(MemorySegment struct) {
        return struct.get(count$LAYOUT, count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t count
     * }
     */
    public static void count(MemorySegment struct, int fieldValue) {
        struct.set(count$LAYOUT, count$OFFSET, fieldValue);
    }

    private static final OfInt empty_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("empty_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t empty_count
     * }
     */
    public static final OfInt empty_count$layout() {
        return empty_count$LAYOUT;
    }

    private static final long empty_count$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t empty_count
     * }
     */
    public static final long empty_count$offset() {
        return empty_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t empty_count
     * }
     */
    public static int empty_count(MemorySegment struct) {
        return struct.get(empty_count$LAYOUT, empty_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t empty_count
     * }
     */
    public static void empty_count(MemorySegment struct, int fieldValue) {
        struct.set(empty_count$LAYOUT, empty_count$OFFSET, fieldValue);
    }

    private static final OfInt column_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("column_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t column_count
     * }
     */
    public static final OfInt column_count$layout() {
        return column_count$LAYOUT;
    }

    private static final long column_count$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t column_count
     * }
     */
    public static final long column_count$offset() {
        return column_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t column_count
     * }
     */
    public static int column_count(MemorySegment struct) {
        return struct.get(column_count$LAYOUT, column_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t column_count
     * }
     */
    public static void column_count(MemorySegment struct, int fieldValue) {
        struct.set(column_count$LAYOUT, column_count$OFFSET, fieldValue);
    }

    private static final OfInt bytes_table$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_table"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table
     * }
     */
    public static final OfInt bytes_table$layout() {
        return bytes_table$LAYOUT;
    }

    private static final long bytes_table$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table
     * }
     */
    public static final long bytes_table$offset() {
        return bytes_table$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table
     * }
     */
    public static int bytes_table(MemorySegment struct) {
        return struct.get(bytes_table$LAYOUT, bytes_table$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table
     * }
     */
    public static void bytes_table(MemorySegment struct, int fieldValue) {
        struct.set(bytes_table$LAYOUT, bytes_table$OFFSET, fieldValue);
    }

    private static final OfInt bytes_type$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_type
     * }
     */
    public static final OfInt bytes_type$layout() {
        return bytes_type$LAYOUT;
    }

    private static final long bytes_type$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_type
     * }
     */
    public static final long bytes_type$offset() {
        return bytes_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_type
     * }
     */
    public static int bytes_type(MemorySegment struct) {
        return struct.get(bytes_type$LAYOUT, bytes_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_type
     * }
     */
    public static void bytes_type(MemorySegment struct, int fieldValue) {
        struct.set(bytes_type$LAYOUT, bytes_type$OFFSET, fieldValue);
    }

    private static final OfInt bytes_entities$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_entities"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_entities
     * }
     */
    public static final OfInt bytes_entities$layout() {
        return bytes_entities$LAYOUT;
    }

    private static final long bytes_entities$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_entities
     * }
     */
    public static final long bytes_entities$offset() {
        return bytes_entities$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_entities
     * }
     */
    public static int bytes_entities(MemorySegment struct) {
        return struct.get(bytes_entities$LAYOUT, bytes_entities$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_entities
     * }
     */
    public static void bytes_entities(MemorySegment struct, int fieldValue) {
        struct.set(bytes_entities$LAYOUT, bytes_entities$OFFSET, fieldValue);
    }

    private static final OfInt bytes_overrides$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_overrides"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_overrides
     * }
     */
    public static final OfInt bytes_overrides$layout() {
        return bytes_overrides$LAYOUT;
    }

    private static final long bytes_overrides$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_overrides
     * }
     */
    public static final long bytes_overrides$offset() {
        return bytes_overrides$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_overrides
     * }
     */
    public static int bytes_overrides(MemorySegment struct) {
        return struct.get(bytes_overrides$LAYOUT, bytes_overrides$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_overrides
     * }
     */
    public static void bytes_overrides(MemorySegment struct, int fieldValue) {
        struct.set(bytes_overrides$LAYOUT, bytes_overrides$OFFSET, fieldValue);
    }

    private static final OfInt bytes_columns$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_columns"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_columns
     * }
     */
    public static final OfInt bytes_columns$layout() {
        return bytes_columns$LAYOUT;
    }

    private static final long bytes_columns$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_columns
     * }
     */
    public static final long bytes_columns$offset() {
        return bytes_columns$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_columns
     * }
     */
    public static int bytes_columns(MemorySegment struct) {
        return struct.get(bytes_columns$LAYOUT, bytes_columns$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_columns
     * }
     */
    public static void bytes_columns(MemorySegment struct, int fieldValue) {
        struct.set(bytes_columns$LAYOUT, bytes_columns$OFFSET, fieldValue);
    }

    private static final OfInt bytes_table_records$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_table_records"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_records
     * }
     */
    public static final OfInt bytes_table_records$layout() {
        return bytes_table_records$LAYOUT;
    }

    private static final long bytes_table_records$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_records
     * }
     */
    public static final long bytes_table_records$offset() {
        return bytes_table_records$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_records
     * }
     */
    public static int bytes_table_records(MemorySegment struct) {
        return struct.get(bytes_table_records$LAYOUT, bytes_table_records$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_records
     * }
     */
    public static void bytes_table_records(MemorySegment struct, int fieldValue) {
        struct.set(bytes_table_records$LAYOUT, bytes_table_records$OFFSET, fieldValue);
    }

    private static final OfInt bytes_column_map$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_column_map"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_column_map
     * }
     */
    public static final OfInt bytes_column_map$layout() {
        return bytes_column_map$LAYOUT;
    }

    private static final long bytes_column_map$OFFSET = 36;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_column_map
     * }
     */
    public static final long bytes_column_map$offset() {
        return bytes_column_map$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_column_map
     * }
     */
    public static int bytes_column_map(MemorySegment struct) {
        return struct.get(bytes_column_map$LAYOUT, bytes_column_map$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_column_map
     * }
     */
    public static void bytes_column_map(MemorySegment struct, int fieldValue) {
        struct.set(bytes_column_map$LAYOUT, bytes_column_map$OFFSET, fieldValue);
    }

    private static final OfInt bytes_component_map$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_component_map"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_map
     * }
     */
    public static final OfInt bytes_component_map$layout() {
        return bytes_component_map$LAYOUT;
    }

    private static final long bytes_component_map$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_map
     * }
     */
    public static final long bytes_component_map$offset() {
        return bytes_component_map$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_map
     * }
     */
    public static int bytes_component_map(MemorySegment struct) {
        return struct.get(bytes_component_map$LAYOUT, bytes_component_map$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_component_map
     * }
     */
    public static void bytes_component_map(MemorySegment struct, int fieldValue) {
        struct.set(bytes_component_map$LAYOUT, bytes_component_map$OFFSET, fieldValue);
    }

    private static final OfInt bytes_dirty_state$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_dirty_state"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_dirty_state
     * }
     */
    public static final OfInt bytes_dirty_state$layout() {
        return bytes_dirty_state$LAYOUT;
    }

    private static final long bytes_dirty_state$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_dirty_state
     * }
     */
    public static final long bytes_dirty_state$offset() {
        return bytes_dirty_state$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_dirty_state
     * }
     */
    public static int bytes_dirty_state(MemorySegment struct) {
        return struct.get(bytes_dirty_state$LAYOUT, bytes_dirty_state$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_dirty_state
     * }
     */
    public static void bytes_dirty_state(MemorySegment struct, int fieldValue) {
        struct.set(bytes_dirty_state$LAYOUT, bytes_dirty_state$OFFSET, fieldValue);
    }

    private static final OfInt bytes_edges$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_edges"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_edges
     * }
     */
    public static final OfInt bytes_edges$layout() {
        return bytes_edges$LAYOUT;
    }

    private static final long bytes_edges$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_edges
     * }
     */
    public static final long bytes_edges$offset() {
        return bytes_edges$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_edges
     * }
     */
    public static int bytes_edges(MemorySegment struct) {
        return struct.get(bytes_edges$LAYOUT, bytes_edges$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_edges
     * }
     */
    public static void bytes_edges(MemorySegment struct, int fieldValue) {
        struct.set(bytes_edges$LAYOUT, bytes_edges$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

