// Generated by jextract

package org.vybe.flecs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ecs_table_record_t {
 *     ecs_table_cache_hdr_t hdr;
 *     int16_t index;
 *     int16_t count;
 *     int16_t column;
 * }
 * }
 */
public class ecs_table_record_t {

    ecs_table_record_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        ecs_table_cache_hdr_t.layout().withName("hdr"),
        flecs.C_SHORT.withName("index"),
        flecs.C_SHORT.withName("count"),
        flecs.C_SHORT.withName("column"),
        MemoryLayout.paddingLayout(2)
    ).withName("ecs_table_record_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout hdr$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("hdr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_table_cache_hdr_t hdr
     * }
     */
    public static final GroupLayout hdr$layout() {
        return hdr$LAYOUT;
    }

    private static final long hdr$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_table_cache_hdr_t hdr
     * }
     */
    public static final long hdr$offset() {
        return hdr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_table_cache_hdr_t hdr
     * }
     */
    public static MemorySegment hdr(MemorySegment struct) {
        return struct.asSlice(hdr$OFFSET, hdr$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_table_cache_hdr_t hdr
     * }
     */
    public static void hdr(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, hdr$OFFSET, hdr$LAYOUT.byteSize());
    }

    private static final OfShort index$LAYOUT = (OfShort)$LAYOUT.select(groupElement("index"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int16_t index
     * }
     */
    public static final OfShort index$layout() {
        return index$LAYOUT;
    }

    private static final long index$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int16_t index
     * }
     */
    public static final long index$offset() {
        return index$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int16_t index
     * }
     */
    public static short index(MemorySegment struct) {
        return struct.get(index$LAYOUT, index$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int16_t index
     * }
     */
    public static void index(MemorySegment struct, short fieldValue) {
        struct.set(index$LAYOUT, index$OFFSET, fieldValue);
    }

    private static final OfShort count$LAYOUT = (OfShort)$LAYOUT.select(groupElement("count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int16_t count
     * }
     */
    public static final OfShort count$layout() {
        return count$LAYOUT;
    }

    private static final long count$OFFSET = 42;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int16_t count
     * }
     */
    public static final long count$offset() {
        return count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int16_t count
     * }
     */
    public static short count(MemorySegment struct) {
        return struct.get(count$LAYOUT, count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int16_t count
     * }
     */
    public static void count(MemorySegment struct, short fieldValue) {
        struct.set(count$LAYOUT, count$OFFSET, fieldValue);
    }

    private static final OfShort column$LAYOUT = (OfShort)$LAYOUT.select(groupElement("column"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int16_t column
     * }
     */
    public static final OfShort column$layout() {
        return column$LAYOUT;
    }

    private static final long column$OFFSET = 44;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int16_t column
     * }
     */
    public static final long column$offset() {
        return column$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int16_t column
     * }
     */
    public static short column(MemorySegment struct) {
        return struct.get(column$LAYOUT, column$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int16_t column
     * }
     */
    public static void column(MemorySegment struct, short fieldValue) {
        struct.set(column$LAYOUT, column$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

