// Generated by jextract

package org.vybe.flecs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int32_t instances;
 *     ecs_size_t bytes_table_components;
 *     ecs_size_t bytes_table_components_unused;
 *     ecs_size_t bytes_toggle_bitsets;
 *     ecs_size_t bytes_sparse_components;
 * }
 * }
 */
public class ecs_component_memory_t {

    ecs_component_memory_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        flecs.C_INT.withName("instances"),
        flecs.C_INT.withName("bytes_table_components"),
        flecs.C_INT.withName("bytes_table_components_unused"),
        flecs.C_INT.withName("bytes_toggle_bitsets"),
        flecs.C_INT.withName("bytes_sparse_components")
    ).withName("$anon$13639:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt instances$LAYOUT = (OfInt)$LAYOUT.select(groupElement("instances"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t instances
     * }
     */
    public static final OfInt instances$layout() {
        return instances$LAYOUT;
    }

    private static final long instances$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t instances
     * }
     */
    public static final long instances$offset() {
        return instances$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t instances
     * }
     */
    public static int instances(MemorySegment struct) {
        return struct.get(instances$LAYOUT, instances$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t instances
     * }
     */
    public static void instances(MemorySegment struct, int fieldValue) {
        struct.set(instances$LAYOUT, instances$OFFSET, fieldValue);
    }

    private static final OfInt bytes_table_components$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_table_components"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_components
     * }
     */
    public static final OfInt bytes_table_components$layout() {
        return bytes_table_components$LAYOUT;
    }

    private static final long bytes_table_components$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_components
     * }
     */
    public static final long bytes_table_components$offset() {
        return bytes_table_components$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_components
     * }
     */
    public static int bytes_table_components(MemorySegment struct) {
        return struct.get(bytes_table_components$LAYOUT, bytes_table_components$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_components
     * }
     */
    public static void bytes_table_components(MemorySegment struct, int fieldValue) {
        struct.set(bytes_table_components$LAYOUT, bytes_table_components$OFFSET, fieldValue);
    }

    private static final OfInt bytes_table_components_unused$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_table_components_unused"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_components_unused
     * }
     */
    public static final OfInt bytes_table_components_unused$layout() {
        return bytes_table_components_unused$LAYOUT;
    }

    private static final long bytes_table_components_unused$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_components_unused
     * }
     */
    public static final long bytes_table_components_unused$offset() {
        return bytes_table_components_unused$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_components_unused
     * }
     */
    public static int bytes_table_components_unused(MemorySegment struct) {
        return struct.get(bytes_table_components_unused$LAYOUT, bytes_table_components_unused$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_table_components_unused
     * }
     */
    public static void bytes_table_components_unused(MemorySegment struct, int fieldValue) {
        struct.set(bytes_table_components_unused$LAYOUT, bytes_table_components_unused$OFFSET, fieldValue);
    }

    private static final OfInt bytes_toggle_bitsets$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_toggle_bitsets"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_toggle_bitsets
     * }
     */
    public static final OfInt bytes_toggle_bitsets$layout() {
        return bytes_toggle_bitsets$LAYOUT;
    }

    private static final long bytes_toggle_bitsets$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_toggle_bitsets
     * }
     */
    public static final long bytes_toggle_bitsets$offset() {
        return bytes_toggle_bitsets$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_toggle_bitsets
     * }
     */
    public static int bytes_toggle_bitsets(MemorySegment struct) {
        return struct.get(bytes_toggle_bitsets$LAYOUT, bytes_toggle_bitsets$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_toggle_bitsets
     * }
     */
    public static void bytes_toggle_bitsets(MemorySegment struct, int fieldValue) {
        struct.set(bytes_toggle_bitsets$LAYOUT, bytes_toggle_bitsets$OFFSET, fieldValue);
    }

    private static final OfInt bytes_sparse_components$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_sparse_components"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_sparse_components
     * }
     */
    public static final OfInt bytes_sparse_components$layout() {
        return bytes_sparse_components$LAYOUT;
    }

    private static final long bytes_sparse_components$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_sparse_components
     * }
     */
    public static final long bytes_sparse_components$offset() {
        return bytes_sparse_components$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_sparse_components
     * }
     */
    public static int bytes_sparse_components(MemorySegment struct) {
        return struct.get(bytes_sparse_components$LAYOUT, bytes_sparse_components$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_sparse_components
     * }
     */
    public static void bytes_sparse_components(MemorySegment struct, int fieldValue) {
        struct.set(bytes_sparse_components$LAYOUT, bytes_sparse_components$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

