// Generated by jextract

package org.vybe.flecs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct {
 *     int32_t count;
 *     int32_t cached_count;
 *     ecs_size_t bytes_query;
 *     ecs_size_t bytes_cache;
 *     ecs_size_t bytes_group_by;
 *     ecs_size_t bytes_order_by;
 *     ecs_size_t bytes_plan;
 *     ecs_size_t bytes_terms;
 *     ecs_size_t bytes_misc;
 * }
 * }
 */
public class ecs_query_memory_t {

    ecs_query_memory_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        flecs.C_INT.withName("count"),
        flecs.C_INT.withName("cached_count"),
        flecs.C_INT.withName("bytes_query"),
        flecs.C_INT.withName("bytes_cache"),
        flecs.C_INT.withName("bytes_group_by"),
        flecs.C_INT.withName("bytes_order_by"),
        flecs.C_INT.withName("bytes_plan"),
        flecs.C_INT.withName("bytes_terms"),
        flecs.C_INT.withName("bytes_misc")
    ).withName("$anon$13658:9");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t count
     * }
     */
    public static final OfInt count$layout() {
        return count$LAYOUT;
    }

    private static final long count$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t count
     * }
     */
    public static final long count$offset() {
        return count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t count
     * }
     */
    public static int count(MemorySegment struct) {
        return struct.get(count$LAYOUT, count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t count
     * }
     */
    public static void count(MemorySegment struct, int fieldValue) {
        struct.set(count$LAYOUT, count$OFFSET, fieldValue);
    }

    private static final OfInt cached_count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("cached_count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int32_t cached_count
     * }
     */
    public static final OfInt cached_count$layout() {
        return cached_count$LAYOUT;
    }

    private static final long cached_count$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int32_t cached_count
     * }
     */
    public static final long cached_count$offset() {
        return cached_count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int32_t cached_count
     * }
     */
    public static int cached_count(MemorySegment struct) {
        return struct.get(cached_count$LAYOUT, cached_count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int32_t cached_count
     * }
     */
    public static void cached_count(MemorySegment struct, int fieldValue) {
        struct.set(cached_count$LAYOUT, cached_count$OFFSET, fieldValue);
    }

    private static final OfInt bytes_query$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_query"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_query
     * }
     */
    public static final OfInt bytes_query$layout() {
        return bytes_query$LAYOUT;
    }

    private static final long bytes_query$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_query
     * }
     */
    public static final long bytes_query$offset() {
        return bytes_query$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_query
     * }
     */
    public static int bytes_query(MemorySegment struct) {
        return struct.get(bytes_query$LAYOUT, bytes_query$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_query
     * }
     */
    public static void bytes_query(MemorySegment struct, int fieldValue) {
        struct.set(bytes_query$LAYOUT, bytes_query$OFFSET, fieldValue);
    }

    private static final OfInt bytes_cache$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_cache"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_cache
     * }
     */
    public static final OfInt bytes_cache$layout() {
        return bytes_cache$LAYOUT;
    }

    private static final long bytes_cache$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_cache
     * }
     */
    public static final long bytes_cache$offset() {
        return bytes_cache$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_cache
     * }
     */
    public static int bytes_cache(MemorySegment struct) {
        return struct.get(bytes_cache$LAYOUT, bytes_cache$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_cache
     * }
     */
    public static void bytes_cache(MemorySegment struct, int fieldValue) {
        struct.set(bytes_cache$LAYOUT, bytes_cache$OFFSET, fieldValue);
    }

    private static final OfInt bytes_group_by$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_group_by"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_group_by
     * }
     */
    public static final OfInt bytes_group_by$layout() {
        return bytes_group_by$LAYOUT;
    }

    private static final long bytes_group_by$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_group_by
     * }
     */
    public static final long bytes_group_by$offset() {
        return bytes_group_by$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_group_by
     * }
     */
    public static int bytes_group_by(MemorySegment struct) {
        return struct.get(bytes_group_by$LAYOUT, bytes_group_by$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_group_by
     * }
     */
    public static void bytes_group_by(MemorySegment struct, int fieldValue) {
        struct.set(bytes_group_by$LAYOUT, bytes_group_by$OFFSET, fieldValue);
    }

    private static final OfInt bytes_order_by$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_order_by"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_order_by
     * }
     */
    public static final OfInt bytes_order_by$layout() {
        return bytes_order_by$LAYOUT;
    }

    private static final long bytes_order_by$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_order_by
     * }
     */
    public static final long bytes_order_by$offset() {
        return bytes_order_by$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_order_by
     * }
     */
    public static int bytes_order_by(MemorySegment struct) {
        return struct.get(bytes_order_by$LAYOUT, bytes_order_by$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_order_by
     * }
     */
    public static void bytes_order_by(MemorySegment struct, int fieldValue) {
        struct.set(bytes_order_by$LAYOUT, bytes_order_by$OFFSET, fieldValue);
    }

    private static final OfInt bytes_plan$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_plan"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_plan
     * }
     */
    public static final OfInt bytes_plan$layout() {
        return bytes_plan$LAYOUT;
    }

    private static final long bytes_plan$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_plan
     * }
     */
    public static final long bytes_plan$offset() {
        return bytes_plan$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_plan
     * }
     */
    public static int bytes_plan(MemorySegment struct) {
        return struct.get(bytes_plan$LAYOUT, bytes_plan$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_plan
     * }
     */
    public static void bytes_plan(MemorySegment struct, int fieldValue) {
        struct.set(bytes_plan$LAYOUT, bytes_plan$OFFSET, fieldValue);
    }

    private static final OfInt bytes_terms$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_terms"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_terms
     * }
     */
    public static final OfInt bytes_terms$layout() {
        return bytes_terms$LAYOUT;
    }

    private static final long bytes_terms$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_terms
     * }
     */
    public static final long bytes_terms$offset() {
        return bytes_terms$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_terms
     * }
     */
    public static int bytes_terms(MemorySegment struct) {
        return struct.get(bytes_terms$LAYOUT, bytes_terms$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_terms
     * }
     */
    public static void bytes_terms(MemorySegment struct, int fieldValue) {
        struct.set(bytes_terms$LAYOUT, bytes_terms$OFFSET, fieldValue);
    }

    private static final OfInt bytes_misc$LAYOUT = (OfInt)$LAYOUT.select(groupElement("bytes_misc"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_misc
     * }
     */
    public static final OfInt bytes_misc$layout() {
        return bytes_misc$LAYOUT;
    }

    private static final long bytes_misc$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_misc
     * }
     */
    public static final long bytes_misc$offset() {
        return bytes_misc$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_misc
     * }
     */
    public static int bytes_misc(MemorySegment struct) {
        return struct.get(bytes_misc$LAYOUT, bytes_misc$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_size_t bytes_misc
     * }
     */
    public static void bytes_misc(MemorySegment struct, int fieldValue) {
        struct.set(bytes_misc$LAYOUT, bytes_misc$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

