// Generated by jextract

package org.vybe.flecs;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct EcsScript {
 *     char *filename;
 *     char *code;
 *     char *error;
 *     ecs_script_t *script;
 *     ecs_script_template_t *template_;
 * }
 * }
 */
public class EcsScript {

    EcsScript() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        flecs.C_POINTER.withName("filename"),
        flecs.C_POINTER.withName("code"),
        flecs.C_POINTER.withName("error"),
        flecs.C_POINTER.withName("script"),
        flecs.C_POINTER.withName("template_")
    ).withName("EcsScript");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout filename$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("filename"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *filename
     * }
     */
    public static final AddressLayout filename$layout() {
        return filename$LAYOUT;
    }

    private static final long filename$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *filename
     * }
     */
    public static final long filename$offset() {
        return filename$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *filename
     * }
     */
    public static MemorySegment filename(MemorySegment struct) {
        return struct.get(filename$LAYOUT, filename$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *filename
     * }
     */
    public static void filename(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(filename$LAYOUT, filename$OFFSET, fieldValue);
    }

    private static final AddressLayout code$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("code"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *code
     * }
     */
    public static final AddressLayout code$layout() {
        return code$LAYOUT;
    }

    private static final long code$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *code
     * }
     */
    public static final long code$offset() {
        return code$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *code
     * }
     */
    public static MemorySegment code(MemorySegment struct) {
        return struct.get(code$LAYOUT, code$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *code
     * }
     */
    public static void code(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(code$LAYOUT, code$OFFSET, fieldValue);
    }

    private static final AddressLayout error$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("error"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *error
     * }
     */
    public static final AddressLayout error$layout() {
        return error$LAYOUT;
    }

    private static final long error$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *error
     * }
     */
    public static final long error$offset() {
        return error$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *error
     * }
     */
    public static MemorySegment error(MemorySegment struct) {
        return struct.get(error$LAYOUT, error$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *error
     * }
     */
    public static void error(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(error$LAYOUT, error$OFFSET, fieldValue);
    }

    private static final AddressLayout script$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("script"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_script_t *script
     * }
     */
    public static final AddressLayout script$layout() {
        return script$LAYOUT;
    }

    private static final long script$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_script_t *script
     * }
     */
    public static final long script$offset() {
        return script$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_script_t *script
     * }
     */
    public static MemorySegment script(MemorySegment struct) {
        return struct.get(script$LAYOUT, script$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_script_t *script
     * }
     */
    public static void script(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(script$LAYOUT, script$OFFSET, fieldValue);
    }

    private static final AddressLayout template_$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("template_"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ecs_script_template_t *template_
     * }
     */
    public static final AddressLayout template_$layout() {
        return template_$LAYOUT;
    }

    private static final long template_$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ecs_script_template_t *template_
     * }
     */
    public static final long template_$offset() {
        return template_$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ecs_script_template_t *template_
     * }
     */
    public static MemorySegment template_(MemorySegment struct) {
        return struct.get(template_$LAYOUT, template_$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ecs_script_template_t *template_
     * }
     */
    public static void template_(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(template_$LAYOUT, template_$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

