// Generated by jextract

package org.vybe.imgui;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ImDrawCmd {
 *     ImVec4 ClipRect;
 *     ImTextureID TextureId;
 *     unsigned int VtxOffset;
 *     unsigned int IdxOffset;
 *     unsigned int ElemCount;
 *     ImDrawCallback UserCallback;
 *     void *UserCallbackData;
 * }
 * }
 */
public class ImDrawCmd {

    ImDrawCmd() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        ImVec4.layout().withName("ClipRect"),
        imgui.C_POINTER.withName("TextureId"),
        imgui.C_INT.withName("VtxOffset"),
        imgui.C_INT.withName("IdxOffset"),
        imgui.C_INT.withName("ElemCount"),
        MemoryLayout.paddingLayout(4),
        imgui.C_POINTER.withName("UserCallback"),
        imgui.C_POINTER.withName("UserCallbackData")
    ).withName("ImDrawCmd");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout ClipRect$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("ClipRect"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ImVec4 ClipRect
     * }
     */
    public static final GroupLayout ClipRect$layout() {
        return ClipRect$LAYOUT;
    }

    private static final long ClipRect$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ImVec4 ClipRect
     * }
     */
    public static final long ClipRect$offset() {
        return ClipRect$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ImVec4 ClipRect
     * }
     */
    public static MemorySegment ClipRect(MemorySegment struct) {
        return struct.asSlice(ClipRect$OFFSET, ClipRect$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ImVec4 ClipRect
     * }
     */
    public static void ClipRect(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, ClipRect$OFFSET, ClipRect$LAYOUT.byteSize());
    }

    private static final AddressLayout TextureId$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("TextureId"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ImTextureID TextureId
     * }
     */
    public static final AddressLayout TextureId$layout() {
        return TextureId$LAYOUT;
    }

    private static final long TextureId$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ImTextureID TextureId
     * }
     */
    public static final long TextureId$offset() {
        return TextureId$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ImTextureID TextureId
     * }
     */
    public static MemorySegment TextureId(MemorySegment struct) {
        return struct.get(TextureId$LAYOUT, TextureId$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ImTextureID TextureId
     * }
     */
    public static void TextureId(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(TextureId$LAYOUT, TextureId$OFFSET, fieldValue);
    }

    private static final OfInt VtxOffset$LAYOUT = (OfInt)$LAYOUT.select(groupElement("VtxOffset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int VtxOffset
     * }
     */
    public static final OfInt VtxOffset$layout() {
        return VtxOffset$LAYOUT;
    }

    private static final long VtxOffset$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int VtxOffset
     * }
     */
    public static final long VtxOffset$offset() {
        return VtxOffset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int VtxOffset
     * }
     */
    public static int VtxOffset(MemorySegment struct) {
        return struct.get(VtxOffset$LAYOUT, VtxOffset$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int VtxOffset
     * }
     */
    public static void VtxOffset(MemorySegment struct, int fieldValue) {
        struct.set(VtxOffset$LAYOUT, VtxOffset$OFFSET, fieldValue);
    }

    private static final OfInt IdxOffset$LAYOUT = (OfInt)$LAYOUT.select(groupElement("IdxOffset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int IdxOffset
     * }
     */
    public static final OfInt IdxOffset$layout() {
        return IdxOffset$LAYOUT;
    }

    private static final long IdxOffset$OFFSET = 28;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int IdxOffset
     * }
     */
    public static final long IdxOffset$offset() {
        return IdxOffset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int IdxOffset
     * }
     */
    public static int IdxOffset(MemorySegment struct) {
        return struct.get(IdxOffset$LAYOUT, IdxOffset$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int IdxOffset
     * }
     */
    public static void IdxOffset(MemorySegment struct, int fieldValue) {
        struct.set(IdxOffset$LAYOUT, IdxOffset$OFFSET, fieldValue);
    }

    private static final OfInt ElemCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("ElemCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int ElemCount
     * }
     */
    public static final OfInt ElemCount$layout() {
        return ElemCount$LAYOUT;
    }

    private static final long ElemCount$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int ElemCount
     * }
     */
    public static final long ElemCount$offset() {
        return ElemCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int ElemCount
     * }
     */
    public static int ElemCount(MemorySegment struct) {
        return struct.get(ElemCount$LAYOUT, ElemCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int ElemCount
     * }
     */
    public static void ElemCount(MemorySegment struct, int fieldValue) {
        struct.set(ElemCount$LAYOUT, ElemCount$OFFSET, fieldValue);
    }

    private static final AddressLayout UserCallback$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("UserCallback"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ImDrawCallback UserCallback
     * }
     */
    public static final AddressLayout UserCallback$layout() {
        return UserCallback$LAYOUT;
    }

    private static final long UserCallback$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ImDrawCallback UserCallback
     * }
     */
    public static final long UserCallback$offset() {
        return UserCallback$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ImDrawCallback UserCallback
     * }
     */
    public static MemorySegment UserCallback(MemorySegment struct) {
        return struct.get(UserCallback$LAYOUT, UserCallback$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ImDrawCallback UserCallback
     * }
     */
    public static void UserCallback(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(UserCallback$LAYOUT, UserCallback$OFFSET, fieldValue);
    }

    private static final AddressLayout UserCallbackData$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("UserCallbackData"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *UserCallbackData
     * }
     */
    public static final AddressLayout UserCallbackData$layout() {
        return UserCallbackData$LAYOUT;
    }

    private static final long UserCallbackData$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *UserCallbackData
     * }
     */
    public static final long UserCallbackData$offset() {
        return UserCallbackData$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *UserCallbackData
     * }
     */
    public static MemorySegment UserCallbackData(MemorySegment struct) {
        return struct.get(UserCallbackData$LAYOUT, UserCallbackData$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *UserCallbackData
     * }
     */
    public static void UserCallbackData(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(UserCallbackData$LAYOUT, UserCallbackData$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

