// Generated by jextract

package org.vybe.imgui;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ImGuiKeyData {
 *     bool Down;
 *     float DownDuration;
 *     float DownDurationPrev;
 *     float AnalogValue;
 * }
 * }
 */
public class ImGuiKeyData {

    ImGuiKeyData() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        imgui.C_BOOL.withName("Down"),
        MemoryLayout.paddingLayout(3),
        imgui.C_FLOAT.withName("DownDuration"),
        imgui.C_FLOAT.withName("DownDurationPrev"),
        imgui.C_FLOAT.withName("AnalogValue")
    ).withName("ImGuiKeyData");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfBoolean Down$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("Down"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool Down
     * }
     */
    public static final OfBoolean Down$layout() {
        return Down$LAYOUT;
    }

    private static final long Down$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool Down
     * }
     */
    public static final long Down$offset() {
        return Down$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool Down
     * }
     */
    public static boolean Down(MemorySegment struct) {
        return struct.get(Down$LAYOUT, Down$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool Down
     * }
     */
    public static void Down(MemorySegment struct, boolean fieldValue) {
        struct.set(Down$LAYOUT, Down$OFFSET, fieldValue);
    }

    private static final OfFloat DownDuration$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("DownDuration"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float DownDuration
     * }
     */
    public static final OfFloat DownDuration$layout() {
        return DownDuration$LAYOUT;
    }

    private static final long DownDuration$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float DownDuration
     * }
     */
    public static final long DownDuration$offset() {
        return DownDuration$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float DownDuration
     * }
     */
    public static float DownDuration(MemorySegment struct) {
        return struct.get(DownDuration$LAYOUT, DownDuration$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float DownDuration
     * }
     */
    public static void DownDuration(MemorySegment struct, float fieldValue) {
        struct.set(DownDuration$LAYOUT, DownDuration$OFFSET, fieldValue);
    }

    private static final OfFloat DownDurationPrev$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("DownDurationPrev"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float DownDurationPrev
     * }
     */
    public static final OfFloat DownDurationPrev$layout() {
        return DownDurationPrev$LAYOUT;
    }

    private static final long DownDurationPrev$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float DownDurationPrev
     * }
     */
    public static final long DownDurationPrev$offset() {
        return DownDurationPrev$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float DownDurationPrev
     * }
     */
    public static float DownDurationPrev(MemorySegment struct) {
        return struct.get(DownDurationPrev$LAYOUT, DownDurationPrev$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float DownDurationPrev
     * }
     */
    public static void DownDurationPrev(MemorySegment struct, float fieldValue) {
        struct.set(DownDurationPrev$LAYOUT, DownDurationPrev$OFFSET, fieldValue);
    }

    private static final OfFloat AnalogValue$LAYOUT = (OfFloat)$LAYOUT.select(groupElement("AnalogValue"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * float AnalogValue
     * }
     */
    public static final OfFloat AnalogValue$layout() {
        return AnalogValue$LAYOUT;
    }

    private static final long AnalogValue$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * float AnalogValue
     * }
     */
    public static final long AnalogValue$offset() {
        return AnalogValue$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * float AnalogValue
     * }
     */
    public static float AnalogValue(MemorySegment struct) {
        return struct.get(AnalogValue$LAYOUT, AnalogValue$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * float AnalogValue
     * }
     */
    public static void AnalogValue(MemorySegment struct, float fieldValue) {
        struct.set(AnalogValue$LAYOUT, AnalogValue$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

