// Generated by jextract

package org.vybe.raylib;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct Wave {
 *     unsigned int frameCount;
 *     unsigned int sampleRate;
 *     unsigned int sampleSize;
 *     unsigned int channels;
 *     void *data;
 * }
 * }
 */
public class Wave {

    Wave() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        raylib.C_INT.withName("frameCount"),
        raylib.C_INT.withName("sampleRate"),
        raylib.C_INT.withName("sampleSize"),
        raylib.C_INT.withName("channels"),
        raylib.C_POINTER.withName("data")
    ).withName("Wave");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt frameCount$LAYOUT = (OfInt)$LAYOUT.select(groupElement("frameCount"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int frameCount
     * }
     */
    public static final OfInt frameCount$layout() {
        return frameCount$LAYOUT;
    }

    private static final long frameCount$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int frameCount
     * }
     */
    public static final long frameCount$offset() {
        return frameCount$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int frameCount
     * }
     */
    public static int frameCount(MemorySegment struct) {
        return struct.get(frameCount$LAYOUT, frameCount$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int frameCount
     * }
     */
    public static void frameCount(MemorySegment struct, int fieldValue) {
        struct.set(frameCount$LAYOUT, frameCount$OFFSET, fieldValue);
    }

    private static final OfInt sampleRate$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sampleRate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int sampleRate
     * }
     */
    public static final OfInt sampleRate$layout() {
        return sampleRate$LAYOUT;
    }

    private static final long sampleRate$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int sampleRate
     * }
     */
    public static final long sampleRate$offset() {
        return sampleRate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int sampleRate
     * }
     */
    public static int sampleRate(MemorySegment struct) {
        return struct.get(sampleRate$LAYOUT, sampleRate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int sampleRate
     * }
     */
    public static void sampleRate(MemorySegment struct, int fieldValue) {
        struct.set(sampleRate$LAYOUT, sampleRate$OFFSET, fieldValue);
    }

    private static final OfInt sampleSize$LAYOUT = (OfInt)$LAYOUT.select(groupElement("sampleSize"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int sampleSize
     * }
     */
    public static final OfInt sampleSize$layout() {
        return sampleSize$LAYOUT;
    }

    private static final long sampleSize$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int sampleSize
     * }
     */
    public static final long sampleSize$offset() {
        return sampleSize$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int sampleSize
     * }
     */
    public static int sampleSize(MemorySegment struct) {
        return struct.get(sampleSize$LAYOUT, sampleSize$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int sampleSize
     * }
     */
    public static void sampleSize(MemorySegment struct, int fieldValue) {
        struct.set(sampleSize$LAYOUT, sampleSize$OFFSET, fieldValue);
    }

    private static final OfInt channels$LAYOUT = (OfInt)$LAYOUT.select(groupElement("channels"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * unsigned int channels
     * }
     */
    public static final OfInt channels$layout() {
        return channels$LAYOUT;
    }

    private static final long channels$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * unsigned int channels
     * }
     */
    public static final long channels$offset() {
        return channels$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * unsigned int channels
     * }
     */
    public static int channels(MemorySegment struct) {
        return struct.get(channels$LAYOUT, channels$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * unsigned int channels
     * }
     */
    public static void channels(MemorySegment struct, int fieldValue) {
        struct.set(channels$LAYOUT, channels$OFFSET, fieldValue);
    }

    private static final AddressLayout data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *data
     * }
     */
    public static final AddressLayout data$layout() {
        return data$LAYOUT;
    }

    private static final long data$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *data
     * }
     */
    public static final long data$offset() {
        return data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *data
     * }
     */
    public static MemorySegment data(MemorySegment struct) {
        return struct.get(data$LAYOUT, data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *data
     * }
     */
    public static void data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(data$LAYOUT, data$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

