// Generated by jextract

package org.vybe.netcode;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct cn_protocol_packet_connection_accepted_t {
 *     uint8_t packet_type;
 *     uint64_t client_id;
 *     uint32_t max_clients;
 *     uint32_t connection_timeout;
 * }
 * }
 */
public class cn_protocol_packet_connection_accepted_t {

    cn_protocol_packet_connection_accepted_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        netcode.C_CHAR.withName("packet_type"),
        MemoryLayout.paddingLayout(7),
        netcode.C_LONG_LONG.withName("client_id"),
        netcode.C_INT.withName("max_clients"),
        netcode.C_INT.withName("connection_timeout")
    ).withName("cn_protocol_packet_connection_accepted_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfByte packet_type$LAYOUT = (OfByte)$LAYOUT.select(groupElement("packet_type"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t packet_type
     * }
     */
    public static final OfByte packet_type$layout() {
        return packet_type$LAYOUT;
    }

    private static final long packet_type$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t packet_type
     * }
     */
    public static final long packet_type$offset() {
        return packet_type$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t packet_type
     * }
     */
    public static byte packet_type(MemorySegment struct) {
        return struct.get(packet_type$LAYOUT, packet_type$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t packet_type
     * }
     */
    public static void packet_type(MemorySegment struct, byte fieldValue) {
        struct.set(packet_type$LAYOUT, packet_type$OFFSET, fieldValue);
    }

    private static final OfLong client_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("client_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t client_id
     * }
     */
    public static final OfLong client_id$layout() {
        return client_id$LAYOUT;
    }

    private static final long client_id$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t client_id
     * }
     */
    public static final long client_id$offset() {
        return client_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t client_id
     * }
     */
    public static long client_id(MemorySegment struct) {
        return struct.get(client_id$LAYOUT, client_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t client_id
     * }
     */
    public static void client_id(MemorySegment struct, long fieldValue) {
        struct.set(client_id$LAYOUT, client_id$OFFSET, fieldValue);
    }

    private static final OfInt max_clients$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_clients"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t max_clients
     * }
     */
    public static final OfInt max_clients$layout() {
        return max_clients$LAYOUT;
    }

    private static final long max_clients$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t max_clients
     * }
     */
    public static final long max_clients$offset() {
        return max_clients$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t max_clients
     * }
     */
    public static int max_clients(MemorySegment struct) {
        return struct.get(max_clients$LAYOUT, max_clients$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t max_clients
     * }
     */
    public static void max_clients(MemorySegment struct, int fieldValue) {
        struct.set(max_clients$LAYOUT, max_clients$OFFSET, fieldValue);
    }

    private static final OfInt connection_timeout$LAYOUT = (OfInt)$LAYOUT.select(groupElement("connection_timeout"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t connection_timeout
     * }
     */
    public static final OfInt connection_timeout$layout() {
        return connection_timeout$LAYOUT;
    }

    private static final long connection_timeout$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t connection_timeout
     * }
     */
    public static final long connection_timeout$offset() {
        return connection_timeout$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t connection_timeout
     * }
     */
    public static int connection_timeout(MemorySegment struct) {
        return struct.get(connection_timeout$LAYOUT, connection_timeout$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint32_t connection_timeout
     * }
     */
    public static void connection_timeout(MemorySegment struct, int fieldValue) {
        struct.set(connection_timeout$LAYOUT, connection_timeout$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

