// Generated by jextract

package org.vybe.netcode;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct cn_socket_send_queue_t {
 *     int count;
 *     int index0;
 *     int index1;
 *     cn_socket_send_queue_item_t items[1024];
 * }
 * }
 */
public class cn_socket_send_queue_t {

    cn_socket_send_queue_t() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        netcode.C_INT.withName("count"),
        netcode.C_INT.withName("index0"),
        netcode.C_INT.withName("index1"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.sequenceLayout(1024, cn_socket_send_queue_item_t.layout()).withName("items")
    ).withName("cn_socket_send_queue_t");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("count"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int count
     * }
     */
    public static final OfInt count$layout() {
        return count$LAYOUT;
    }

    private static final long count$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int count
     * }
     */
    public static final long count$offset() {
        return count$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int count
     * }
     */
    public static int count(MemorySegment struct) {
        return struct.get(count$LAYOUT, count$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int count
     * }
     */
    public static void count(MemorySegment struct, int fieldValue) {
        struct.set(count$LAYOUT, count$OFFSET, fieldValue);
    }

    private static final OfInt index0$LAYOUT = (OfInt)$LAYOUT.select(groupElement("index0"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int index0
     * }
     */
    public static final OfInt index0$layout() {
        return index0$LAYOUT;
    }

    private static final long index0$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int index0
     * }
     */
    public static final long index0$offset() {
        return index0$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int index0
     * }
     */
    public static int index0(MemorySegment struct) {
        return struct.get(index0$LAYOUT, index0$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int index0
     * }
     */
    public static void index0(MemorySegment struct, int fieldValue) {
        struct.set(index0$LAYOUT, index0$OFFSET, fieldValue);
    }

    private static final OfInt index1$LAYOUT = (OfInt)$LAYOUT.select(groupElement("index1"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int index1
     * }
     */
    public static final OfInt index1$layout() {
        return index1$LAYOUT;
    }

    private static final long index1$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int index1
     * }
     */
    public static final long index1$offset() {
        return index1$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int index1
     * }
     */
    public static int index1(MemorySegment struct) {
        return struct.get(index1$LAYOUT, index1$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int index1
     * }
     */
    public static void index1(MemorySegment struct, int fieldValue) {
        struct.set(index1$LAYOUT, index1$OFFSET, fieldValue);
    }

    private static final SequenceLayout items$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("items"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * cn_socket_send_queue_item_t items[1024]
     * }
     */
    public static final SequenceLayout items$layout() {
        return items$LAYOUT;
    }

    private static final long items$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * cn_socket_send_queue_item_t items[1024]
     * }
     */
    public static final long items$offset() {
        return items$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * cn_socket_send_queue_item_t items[1024]
     * }
     */
    public static MemorySegment items(MemorySegment struct) {
        return struct.asSlice(items$OFFSET, items$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * cn_socket_send_queue_item_t items[1024]
     * }
     */
    public static void items(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, items$OFFSET, items$LAYOUT.byteSize());
    }

    private static long[] items$DIMS = { 1024 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * cn_socket_send_queue_item_t items[1024]
     * }
     */
    public static long[] items$dimensions() {
        return items$DIMS;
    }
    private static final MethodHandle items$ELEM_HANDLE = items$LAYOUT.sliceHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * cn_socket_send_queue_item_t items[1024]
     * }
     */
    public static MemorySegment items(MemorySegment struct, long index0) {
        try {
            return (MemorySegment)items$ELEM_HANDLE.invokeExact(struct, 0L, index0);
        } catch (Throwable ex$) {
            throw new AssertionError("should not reach here", ex$);
        }
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * cn_socket_send_queue_item_t items[1024]
     * }
     */
    public static void items(MemorySegment struct, long index0, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, items(struct, index0), 0L, cn_socket_send_queue_item_t.layout().byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

